[
"Order the strangest drink",
"Cheers the table next to you",
"Lead a toast to the bar",
"Swap a drink with someone (safely)",
"Sing a karaoke song",
"Dance with a stranger",
"Take a shot without flinching",
"Invent a new cocktail with the bartender",
"Start a conga line with at least 6 people joining in",
"Pose for a photo with the bouncer",
"Tell the bar your best joke",
"Give a speech about your 'first time' at this bar",
"Community Cup! Take an empty glass, pour a portion of everyone's drink in it and chug it!",
"Order a shot but you have to drink it through a straw",
"Finish your current drink, if you don't have one, steal another player's",
"Ask the bartender if they can put on Bluey because you can't miss the next episode",
"Get a selfie with another group but act drunk while you're asking it",
"Ask the oldest & grumpiest person in the bar, for random life advice",
"Pretend to be a magician to a random person in the bar... but fail with confidence",
"Lead a toast out loud but say 'To passing my prostate, even though they had to use 3 fingers'",
"Is your crush here? Ask them if they want to play the 'Ice Game'",
"Fake a public proposal to get free drinks",
"Swap shirts to the person to your Left",
"Pretend to have a loud phone conversation with someone famous.",
"Pretend to give an imaginary person a lap dance",
"Pick another player, play the P*nis game, and try to win. (Who can say the word P*nis loudest)",
"Get a hug from 3 random strangers",
"Randomly cheer for the next person that walks in the bar",
"Ask a random stranger, if you can see their camera roll",
"Order a drink but you can only make animal sounds.",
"Balance everything on your table on top of each other that isn't made of glass",
"Go to the center of the establishment, do 5 jumping jacks and say 'I love bar workouts",
"Choose 1 person in your game to give you a dare of their choosing!",
"Walk around and pretend to interview people like you're a TV reporter.",
"Order a can of soda but tell them you want it shaken not stirred",
"Challenge a random person to a thumb war",
"Order a long island ice tea but before they start making it, say but no alcohol",
"Pretend to be a bouncer and re-check someone's ID",
"Pretend to be a psychic and tell someone a bad reading",
"Hydrate! Chug A Tall glass of Ice Water",
"Wingman! Go up to someone and talk up your friend up. If the person goes up and talks to them, you pass",
"Go to a random person and say 'you know, you're not as bad as they say you are'",
"Order someone completely random a water and go up and say 'This One's on me'",
"Spread Kindness: Go up to someone and just tell them they are beautiful/handsome and walk away",
"Time Traveler: Go up to someone, ask them what year it is, and say 'Oh Good, we're safe'",
"Start a slow clap for 20 seconds",
"Stand up and announce to the bar to close their eyes for 30 seconds to do a 'mind reset'",
"Spread Kindness: Tell a random person they have a great smile",
"Lock eyes with a stranger and blow them a kiss",
"Do a shot without using your hands",
"Fake an orgasm (loudly!)",
"Perform a mime routine for 20 seconds",
"Pretend the floor is lava and try to make it to the restroom",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Order your next drink in a Pirate accent",
"Have a stranger tell you their best joke but keep a straight face the entire time",
"Do a tap dance for 10 seconds",
"Drink the rest of your drink in SLOW motion",
"Send a text to your ex saying 'you were right'",
"Minor Inconvenience: tell a random stranger that you hope both sides of their pillows are warm",
"Violent Compliment: Give a stranger a compliment but say it in an aggressive tone",
"Yell: 'You know what this bar needs? MORE COWBELL'",
"Put on a French accent and convince a total stranger that you're actually French",
"Go up to a random person, and ask to hold their hand. If they say yes, you complete this dare!",
"Get a stranger to play fuck-marry-kill with you and two others in your group. Killed member takes a shot.",
"Choose an intimate position, reenact it using only your hands, if a stranger can guess correctly, you complete this dare!",
"Ask a stranger to awkward middle school dance with you",
"Make and wear a miss America sash out of toilet paper",
"Venmo a stranger $.50 with the note 'tongue tango lessons'",
"Find a person of the opposite gender and arm wrestle them!",
"Get a random stranger to give you a dare!",
"Order your next drink while getting a piggy back ride",
"Obtain a condom, and give a presentation on how to put it on, using a beer bottle",
"Obtain a condom and give it to a random person and wink at them.",
"Remove someone's belt with your teeth. If they decline, you lose!",
"Waterfall! Pour your drink into your mouth using arm's length",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Attempt to get a free shot from the bartender or someone at the bar, if you succeed, you complete this dare!",
"Tie a cherry stem with your tongue",
"Make eye contact and blow a kiss to a random stranger",
"Remember Me? – Convince a stranger that you've known each other for years",
"Voice of an Angel – Serenade a random girl/bar",
"The Superstar – Ask a random stranger for their autograph as if they're famous",
"The Pint-Puller – Convince the bartender to let you pour your own drink",
"Bear Hug – Hug a stranger for as long as possible – Don't stop until they ask!",
"Mr. International – Talk to a random stranger in a foreign accent and convince them you're from that country.",
"The instructor – Attempt to teach a random group of strangers how to breakdance… even if you don't know how to do it yourself",
"Get a photo with the hottest person in the bar, NOT in your current group.",
"Go in the middle of the place, and sing 'Can you feel the Kenergy? Feels so real, my Kenergy. Can you feel the Kenergy? Feels so real, my Kenergy'",
"Ask the bartender to drain the pour mat, into a shot glass. DRINK UP!",
"Get someone who isn't taking part in the Challenge to buy you a drink (YOU WIN EVERYTHING IF they buy the team a round)",
"Ask the bartender for their number, you pass if it's their REAL one!",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Challenge a random person to flip cup (1 cup each though), if you win, you complete this!",
"Text the 8th person in your messages list, saying 'Hey, I'm thinking of you.'",
"Next person who walks through the door, you have to say 'Hey, you're looking FINE'",
"Post on your Insta Story 'how does it feel to have pubic lice? Question for a friend…'",
"Body shot! Someone has to take a body drink from your bellybutton!",
"Video chat the person of your choice but pick your nose through the entire conversation.",
"Ask a group of strangers, where you can get a Plan B pill Because pull out game is weak.",
"yell a players name that you would sleep with.",
"Stand up and yell 'Can I get a HOY YA' really loud",
"Walk up to a stranger, sniff their beer, make eye contact, and walk away",
"Take a shot of Malort",
"Ask the bartender to give. you their worst drink.",
"Everytime you order a drink, tell the bartender 'Thanks Daddy'. ",
"Text your ex, 'We Need To Talk...",
"Pick someone to chug the rest of your drink. If they refuse, you lose.",
"Convince the bartender you've known eachother since highschool.",
"Convience the bartender that you're friends with Jose that 'Works There'",
"Order whatever the bartender (considers) a 'Bitch' shot.",
"Ask the bartender for a drink strong enough to forget your cousin, they just broke up with you.",
"Convience the bartender to write your number on your chest.",
"Order a round of water shots, convince everyone they are water",
"Ask the bartender for a cherry and eat it while making eye contact.",
"Go to a stranger and ask if they've seen your pet penguin.",
"Get three people to take a selfie with you using a ridiculous pose.",
"Speak in a movie trailer voice when ordering your next drink.",
"Create a fake name and backstory for yourself and introduce yourself to someone new.",
"Collect five different drink coasters from around the bar.",
"Ask a stranger to teach you their best dance move.",
"Find a group watching sports and cheer loudly for the wrong team.",
"Perform an impromptu magic trick using bar items for a stranger.",
"Try to convince someone that you're a famous DJ's cousin.",
"Order your next drink while speaking only in rhymes.",
"Draw a portrait of someone in your group on a napkin and give it to them.",
"Start a debate about which bar snack is superior with a neighboring table.",
"Put on someone else's glasses and walk around acting like you can't see.",
"Ask a stranger what song they'd recommend for the jukebox.",
"Stand up and announce an imaginary lost and found item.",
"Try to stack three beer coasters on your head for 10 seconds.",
"Create a silly nickname for each person in your group and use them for the rest of the night.",
"Ask someone to help you solve a made-up riddle.",
"Use an accent when talking to the next three people you meet.",
"Get a stranger to teach you a toast in another language.",
"Challenge someone to a staring contest.",
"Make a paper airplane out of a napkin and fly it to another table.",
"Go to the bar and order 'whatever the person before me had.'",
"Ask someone to help you name your imaginary pet rock.",
"Serenade someone with just the chorus of a popular song.",
"Find someone with the same color shirt as you and take a 'twin' photo.",
"Create an elaborate handshake with a stranger.",
"Pay a compliment to every person standing at the bar.",
"Approach a table and offer to be their designated photographer for one picture.",
"Write a short poem about the bar on a napkin and give it to the bartender.",
"Try to convince someone you're a professional thumb wrestler.",
"Make up a cocktail name and ask if the bartender can make it.",
"Tell a stranger they remind you of your favorite celebrity (be specific).",
"Balance a spoon on your nose for 15 seconds.",
"Find someone with the same shoe size as you.",
"Ask three different people what their go-to karaoke song is.",
"Speak only in questions for five minutes straight.",
"Try to find someone with the same birthday month as you.",
"Give an acceptance speech for winning 'Best Bar Patron of the Year'.",
"Ask the bartender for their best dad joke.",
"Find someone wearing a watch and ask them what time it is in Tokyo.",
"Act as a 'hype person' for someone in your group for their next drink order.",
"Exchange an item with a stranger for 5 minutes (nothing valuable).",
"Order your drink while standing in a superhero pose.",
"Go ask a group if they need an extra player for whatever game they're playing.",
"Try to get three strangers to fist bump you in a row.",
"Ask someone to rate your fake British accent from 1-10.",
"Find someone with the same first initial as you and take a selfie together.",
"Convince a stranger to draw your portrait on a napkin.",
"Speak in the third person about yourself for 10 minutes.",
"Ask a stranger to help you settle a fake debate with your friend.",
"Order a drink and ask if they can make it 'with extra clouds.'",
"Find someone wearing jewelry and compliment it specifically.",
"Try to guess someone's occupation (ask first if they're willing to play).",
"Trade seats with someone from another table for 2 minutes.",
"Ask a stranger for their best life advice.",
"Challenge someone to a paper-rock-scissors tournament, best of three.",
"Try to find someone who knows all the words to the national anthem.",
"Give someone your best pickup line but use it to ask for their food recommendation.",
"Ask three people what their spirit animal is.",
"Make a toast to an imaginary friend named Bartholomew.",
"Try to find someone who shares your middle name.",
"Ask the bartender for a glass of water with 'exactly seven ice cubes.'",
"Attempt to start a wave in the bar.",
"Challenge a stranger to see who can balance a coaster on their forehead longer.",
"Ask the DJ or bartender to play a song that reminds you of high school.",
"Create a secret signal with a stranger that you'll both use throughout the night.",
"Introduce two strangers to each other with made-up fun facts about them.",
"Ask someone if they can touch their nose with their tongue (then try it yourself).",
"Try to find someone who's been to a country you'd like to visit.",
"Have someone blindfold you with a napkin and guess what drink they give you (just smell it).",
"Ask a stranger to help you come up with a new signature for your credit card.",
"Try to get five people to join you in doing the wave.",
"Speak in a whisper to everyone for three minutes straight.",
"Say hello to someone in five different ways.",
"Ask a stranger if they'd rather fight 100 duck-sized horses or one horse-sized duck.",
"Try to find someone wearing the exact same shoes as you.",
"Play 'would you rather' with someone you don't know.",
"Ask three people what they think your name should be based on your appearance.",
"Convince a stranger to arm wrestle you (gently).",
"Find someone from another state or country and ask about their hometown.",
"Make up a childhood memory with a stranger as if you grew up together.",
"Ask the bartender what the strangest order they've ever received was.",
"Go to the restroom and come back with your clothing adjusted in a silly (but appropriate) way.",
"Hand out imaginary business cards to three people.",
"Ask someone to help you name your next pet.",
"Try to guess someone's favorite movie in three tries.",
"Get a stranger to teach you a word in another language.",
"Speak to the next person you meet as if they're royalty.",
"Ask the bartender for a drink that matches your personality.",
"Get three strangers to join you in a group hug (ask permission first).",
"Create a secret handshake with the bartender.",
"Pretend you're a food critic and review the bar snacks dramatically.",
"Ask a stranger to tie your shoelace (if wearing lace-up shoes).",
"Stand up and announce a fake birthday for someone in your group.",
"Try to find someone with the same phone case as you.",
"Ask three people what superpower they'd most want to have.",
"Challenge a stranger to see who can make the best paper boat from a napkin.",
"Go to a group and ask if you can take their friend for a dance (with their permission).",
"Order your next drink in slow motion.",
"Ask someone to guess what you do for a living.",
"Find a stranger and ask them to choose your next drink.",
"Try to convince someone you're practicing to be a talk show host and interview them.",
"Ask three people their favorite breakfast food.",
"Make up a handshake with the bartender that gets more elaborate each time you order.",
"Get a stranger to teach you a dance move, then show it to your friends.",
"Stand at the door for 1 minute and greet people like you own the place.",
"Challenge someone to a 'who can make the weirdest face' contest.",
"Ask someone to help you name your band.",
"Trade an accessory with a stranger for 10 minutes (with their permission).",
"Ask two strangers if they can settle a fake disagreement between you and a friend.",
"Order your drink while pretending to be on a secret mission.",
"Try to get the entire bar to do a toast at the same time.",
"Speak to a stranger as if they're a long-lost friend you're surprised to see.",
"Ask someone to help you practice a fake acceptance speech.",
"Challenge a stranger to see who can say the alphabet backward faster.",
"Pretend to be a talent scout and 'audition' someone for a reality show.",
"Ask three people what their first concert was.",
"Challenge someone to a dance-off to just one chorus of a song.",
"Collect signatures on a napkin for an imaginary petition (something silly).",
"Try to get a stranger to teach you a magic trick.",
"Ask someone to name three things you have in common (after a brief chat).",
"Get a stranger to join you in a synchronized drink sip.",
"Ask three people for their favorite joke.",
"Create a fake award and present it to a stranger for something mundane.",
"Challenge someone to a thumb war championship.",
"Ask a stranger to help you solve a made-up mystery.",
"Get five different people to high-five you in unique ways.",
"Ask someone to help you remember where you 'parked your time machine.'",
"Pretend to be a tourist and ask someone for local recommendations.",
"Have someone draw a temporary tattoo on your arm with a pen.",
"Ask a stranger what they think happened to your imaginary friend.",
"Get three people to join you in a dramatic reading of a drink menu item.",
"Ask someone to teach you how to say 'cheers' in their native language.",
"Create a handshake with someone that's at least five moves long.",
"Challenge a stranger to see who can balance a bar straw on their finger longer.",
"Ask someone to participate in an impromptu 'this or that' game.",
"Find two strangers with the same name.",
"See if anyone in the bar shares your birthday.",
"Try to find someone who's never seen your favorite movie.",
"Play charades with a stranger using bar-related items as clues.",
"Ask three people what they think the meaning of life is.",
"Try to get a stranger to join you in a duet of a popular song chorus.",
"Ask someone to rate your dance moves on a scale of 1-10.",
"Pretend to be doing research for a book about bars and interview someone.",
"Challenge someone to a napkin-folding contest to make the coolest design.",
"Ask a stranger if they can help you practice your networking skills.",
"Try to find someone who knows all the words to a currently playing song."
  ]