[
    "Order the strangest drink",
    "Cheers the table next to you",
    "Lead a toast to the bar",
    "Swap a drink with someone (safely)",
    "Sing a karaoke song",
    "Dance with a stranger",
    "Take a shot without flinching",
    "Invent a new cocktail with the bartender",
    "Start a conga line with at least 6 people joining in",
    "Pose for a photo with the bouncer",
    "Tell the bar your best joke",
    "Give a speech about your 'first time' at this bar",
    "Community Cup! Take an empty glass, pour a portion of everyone's drink in it and chug it!",
    "Order a shot but you have to drink it through a straw",
    "Finish your current drink, if you don't have one, steal another player's",
    "Ask the bartender if they can put on Bluey because you can't miss the next episode",
    "Get a selfie with another group but act drunk while you're asking it",
    "Ask the oldest & grumpiest person in the bar, for random life advice",
    "Pretend to be a magician to a random person in the bar... but fail with confidence",
    "Lead a toast out loud but say 'To passing my prostate, even though they had to use 3 fingers'",
    "Is your crush here? Ask them if they want to play the 'Ice Game'",
    "Fake a public proposal to get free drinks",
    "Swap shirts to the person to your Left",
    "Pretend to have a loud phone conversation with someone famous.",
    "Pretend to give an imaginary person a lap dance",
    "Pick another player, play the P*nis game, and try to win. (Who can say the word P*nis loudest)",
    "Get a hug from 3 random strangers",
    "Randomly cheer for the next person that walks in the bar",
    "Ask a random stranger, if you can see their camera roll",
    "Order a drink but you can only make animal sounds.",
    "Balance everything on your table on top of each other that isn't made of glass",
    "Go to the center of the establishment, do 5 jumping jacks and say 'I love bar workouts",
    "Choose 1 person in your game to give you a dare of their choosing!",
    "Walk around and pretend to interview people like you're a TV reporter.",
    "Order a can of soda but tell them you want it shaken not stirred",
    "Challenge a random person to a thumb war",
    "Order a long island ice tea but before they start making it, say but no alcohol",
    "Pretend to be a bouncer and re-check someone's ID",
    "Pretend to be a psychic and tell someone a bad reading",
    "Hydrate! Chug A Tall glass of Ice Water",
    "Wingman! Go up to someone and talk up your friend up. If the person goes up and talks to them, you pass",
    "Go to a random person and say 'you know, you're not as bad as they say you are'",
    "Order someone completely random a water and go up and say 'This One's on me'",
    "Spread Kindness: Go up to someone and just tell them they are beautiful/handsome and walk away",
    "Time Traveler: Go up to someone, ask them what year it is, and say 'Oh Good, we're safe'",
    "Start a slow clap for 20 seconds",
    "Stand up and announce to the bar to close their eyes for 30 seconds to do a 'mind reset'",
    "Spread Kindness: Tell a random person they have a great smile",
    "Lock eyes with a stranger and blow them a kiss",
    "Do a shot without using your hands",
    "Fake an orgasm (loudly!)",
    "Perform a mime routine for 20 seconds",
    "Pretend the floor is lava and try to make it to the restroom",
    "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
    "Order your next drink in a Pirate accent",
    "Have a stranger tell you their best joke but keep a straight face the entire time",
    "Do a tap dance for 10 seconds",
    "Drink the rest of your drink in SLOW motion",
    "Send a text to your ex saying 'you were right'",
    "Minor Inconvenience: tell a random stranger that you hope both sides of their pillows are warm",
    "Violent Compliment: Give a stranger a compliment but say it in an aggressive tone",
    "Yell: 'You know what this bar needs? MORE COWBELL'",
    "Put on a French accent and convince a total stranger that you're actually French",
    "Go up to a random person, and ask to hold their hand. If they say yes, you complete this dare!",
    "Get a stranger to play fuck-marry-kill with you and two others in your group. Killed member takes a shot.",
    "Choose an intimate position, reenact it using only your hands, if a stranger can guess correctly, you complete this dare!",
    "Ask a stranger to awkward middle school dance with you",
    "Make and wear a miss America sash out of toilet paper",
    "Venmo a stranger $.50 with the note 'tongue tango lessons'",
    "Find a person of the opposite gender and arm wrestle them!",
    "Get a random stranger to give you a dare!",
    "Order your next drink while getting a piggy back ride",
    "Obtain a condom, and give a presentation on how to put it on, using a beer bottle",
    "Obtain a condom and give it to a random person and wink at them.",
    "Remove someone's belt with your teeth. If they decline, you lose!",
    "Waterfall! Pour your drink into your mouth using arm's length",
    "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
    "Attempt to get a free shot from the bartender or someone at the bar, if you succeed, you complete this dare!",
    "Tie a cherry stem with your tongue",
    "Make eye contact and blow a kiss to a random stranger",
    "Remember Me? – Convince a stranger that you've known each other for years",
    "Voice of an Angel – Serenade a random girl/bar",
    "The Superstar – Ask a random stranger for their autograph as if they're famous",
    "The Pint-Puller – Convince the bartender to let you pour your own drink",
    "Bear Hug – Hug a stranger for as long as possible – Don't stop until they ask!",
    "Mr. International – Talk to a random stranger in a foreign accent and convince them you're from that country.",
    "The instructor – Attempt to teach a random group of strangers how to breakdance… even if you don't know how to do it yourself",
    "Get a photo with the hottest person in the bar, NOT in your current group.",
    "Go in the middle of the place, and sing 'Can you feel the Kenergy? Feels so real, my Kenergy. Can you feel the Kenergy? Feels so real, my Kenergy'",
    "Ask the bartender to drain the pour mat, into a shot glass. DRINK UP!",
    "Get someone who isn't taking part in the Challenge to buy you a drink (YOU WIN EVERYTHING IF they buy the team a round)",
    "Ask the bartender for their number, you pass if it's their REAL one!",
    "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
    "Challenge a random person to flip cup (1 cup each though), if you win, you complete this!",
    "Text the 8th person in your messages list, saying 'Hey, I'm thinking of you. Make the decision to complete or not before looking'",
    "Next person who walks through the door, you have to say 'Hey, you're looking FINE'",
    "Post on your Insta Story 'how does it feel to have pubic lice? Question for a friend…'",
    "Body shot! Someone has to take a body drink from your bellybutton!",
    "Video chat the person of your choice but pick your nose through the entire conversation.",
    "Ask a group of strangers, where you can get a Plan B pill Because pull out game is weak."

  ]