[
    "Take erotic and exciting pictures of your partner",
    "Stand against the wall and let your partner search your body",
    "Tease your partner by rubbing ice cubes over their body. Circle the ice cubes around their nipples, belly, inner thighs and private areas",
    "Give your partner a sensual French kiss",
    "Give your partner a hickey in a private place",
    "Turn on some sensual music and give your partner a striptease",
    "Write a short erotic poem for your partner",
    "Whisper naughty fantasies in your partner’s ear",
    "Treat your partner to an erotic show by touching yourself in front of them",
    "With a marker, draw a love tattoo on your partner’s chest/breasts",
    "Rub oil or lotion on your partner’s upper body",
    "Do 5 push-ups on top of your partner",
    "Cover your partner’s body with kisses",
    "Massage your partner’s back",
    "Take a shower together and rinse down your partner with soap",
    "Sing the chorus of a love ballad to your partner",
    "Enjoy your partner in a room where you’ve never had sex",
    "Unzip your partner’s pants without using your hands",
    "Call an escort service and pretend to apply for a job",
    "Lick and kiss your partner’s inner thighs",
    "Tie your partner’s hands and please them orally",
    "When going down on your partner, hum a song to them and make them guess what it is",
    "Lick any liquid substance off of my neck",
    "Dance to one song for me",
    "Tell me something you've never told anyone before",
    "Imitate me doing something you think is cute",
    "Passionately kiss me",
    "Describe the most exciting dream you've had about me",
    "Play me a song you’d like to hear during sex",
    "Give me a massage anywhere you'd like",
    "Text me a sexy photo from a different room",
    "Draw your version of a perfect date night",
    "Put your favorite topping (peanut butter, chocolate sauce, whipped cream, etc.) on your favorite parts of my body. Then, lick it off",
    "Show me a sex toy you want us to use",
    "Tell me something right now that you've been fantasizing about",
    "Describe your ideal role-play scenario to me",
    "Give me your best lap dance",
    "Take off my top using only one hand",
    "Tell me what you loved most about the last time we had sex",
    "Without touching me, do something you think will turn me on",
    "Talk in your hottest accent",
    "Take a shower with me and wash my body, making sure to hit all the good spots",
    "Pretend I’m a stranger you met at a club. Now, try to pick me up and persuade me to come home with you",
    "In detail, describe your first time having sex",
    "Find a way to give me goosebumps. But you can only use your fingers",
    "Tell me what was going through your mind the first time we had sex",
    "Eat a piece of fruit in the sexiest way possible",
    "Act out the move that I do during sex that you absolutely love",
    "Spell out a message on my body with your tongue. Make it short and sensual",
    "Leave me a voice note with all the things you want to do to me tonight on it",
    "Sing me the sexiest song that pops into your mind",
    "Without speaking, demonstrate your favorite position we've done",
    "Take off one article of my clothing using only your teeth",
    "Blindfold me and then touch me with a random object until I guess what it is",
    "Pick your favorite sexy scene from a film and watch it with me",
    "Pick two articles of clothing you’d like me to take off",
    "Try to undo my pants with just your mouth. You have two minutes",
    "Put a blindfold on and guess which part of my body you’re kissing",
    "Do something with me that you’ve been wanting to do since we started playing",
    "In detail, describe what I look like when I orgasm",
    "Pick one item you’d want to restrain me with next time we have sex",
    "Write me a love letter. I can’t read it until the game is over",
    "You have 60 seconds: try to turn me on using just your mouth",
    "Show me a picture of someone we know that you’d like to bring in for a threesome",
    "Go pick out your favorite set of lingerie that I own",
    "Pick a steamy movie for us to watch tonight",
    "Pick the first five songs of our joint sex playlist",
    "Pick out a new sex position that you’ve been wanting to try",
    "Kiss a part of my body that you think needs extra TLC",
    "Grab an ice cube and drag it anywhere along my body until it melts",
    "Show me a sexy photo of yourself that I’ve never seen before",
    "In detail, describe how you like to masturbate",
    "Be my photographer and help me take a sexy photo that only you can keep",
    "Do your best twerking moves for 20 seconds",
    "Kiss me upside down like Mary Jane kissed Spiderman",
    "With your tongue, write a word that describes me on my back",
    "Use your finger to write your name on your favorite part of my body",
    "Pick up my finger or hand and show me how you like to receive oral sex",
    "Kiss me anywhere you want",
    "Give me a 30-second lap dance. (Both husband and wife should try this)",
    "Use your fingers to trace over your favorite parts of my body",
    "Hold my hand while you kiss me for 20 seconds",
    "Lick my back and form a word you want me to guess",
    "Suck on my belly button",
    "Kiss your way down my back or stomach",
    "Massage me with oil any way you choose for 30 seconds",
    "Snuggle me how you like for 20 seconds",
    "Stimulate two parts of my body at once. Use your hands on one part and your lips on the other",
    "Take a sexy selfie and text it to me right now",
    "Show me the part of your body that you think I find the sexiest",
    "Kiss me with your eyes open for 30 seconds",
    "You’re dared to describe the way I taste",
    "Show me a toy you are curious about, but also a little nervous to try",
    "Find an adult film with some moves you’d like to try and show it to me",
    "Close your eyes and guess which body part I’m of mine about to press up against you",
    "Allow me to film oral, for 15 seconds",
    "Count my teeth with your tongue",
    "Undress (I will too) and look into my eyes without touching me at all for 1 minute (or as long as we can)",
    "Play the ice game with me. *Makeout with ice until it melts*",
    "Let me play with an ice cube in your belly button"
  ]
  