[
"Take erotic and exciting pictures of your partner",
"Stand against the wall and let your partner search your body",
"Tease your partner by rubbing ice cubes over their body. Circle the ice cubes around their nipples, belly, inner thighs and private areas",
"Give your partner a sensual French kiss",
"Give your partner a hickey in a private place",
"Turn on some sensual music and give your partner a striptease",
"Write a short erotic poem for your partner",
"Whisper naughty fantasies in your partner’s ear",
"Treat your partner to an erotic show by touching yourself in front of them",
"With a marker, draw a love tattoo on your partner’s chest/breasts",
"Rub oil or lotion on your partner’s upper body",
"Do 5 push-ups on top of your partner",
"Cover your partner’s body with kisses",
"Massage your partner’s back",
"Take a shower together and rinse down your partner with soap",
"Sing the chorus of a love ballad to your partner",
"Enjoy your partner in a room where you’ve never had sex",
"Unzip your partner’s pants without using your hands",
"Call an escort service and pretend to apply for a job",
"Lick and kiss your partner’s inner thighs",
"Tie your partner’s hands and please them orally",
"When going down on your partner, hum a song to them and make them guess what it is",
"Lick any liquid substance off of my neck",
"Dance to one song for me",
"Tell me something you've never told anyone before",
"Imitate me doing something you think is cute",
"Passionately kiss me",
"Describe the most exciting dream you've had about me",
"Play me a song you’d like to hear during sex",
"Give me a massage anywhere you'd like",
"Text me a sexy photo from a different room",
"Draw your version of a perfect date night",
"Put your favorite topping (peanut butter, chocolate sauce, whipped cream, etc.) on your favorite parts of my body. Then, lick it off",
"Show me a sex toy you want us to use",
"Tell me something right now that you've been fantasizing about",
"Describe your ideal role-play scenario to me",
"Give me your best lap dance",
"Take off my top using only one hand",
"Tell me what you loved most about the last time we had sex",
"Without touching me, do something you think will turn me on",
"Talk in your hottest accent",
"Take a shower with me and wash my body, making sure to hit all the good spots",
"Pretend I’m a stranger you met at a club. Now, try to pick me up and persuade me to come home with you",
"In detail, describe your first time having sex",
"Find a way to give me goosebumps. But you can only use your fingers",
"Tell me what was going through your mind the first time we had sex",
"Eat a piece of fruit in the sexiest way possible",
"Act out the move that I do during sex that you absolutely love",
"Spell out a message on my body with your tongue. Make it short and sensual",
"Leave me a voice note with all the things you want to do to me tonight on it",
"Sing me the sexiest song that pops into your mind",
"Without speaking, demonstrate your favorite position we've done",
"Take off one article of my clothing using only your teeth",
"Blindfold me and then touch me with a random object until I guess what it is",
"Pick your favorite sexy scene from a film and watch it with me",
"Pick two articles of clothing you’d like me to take off",
"Try to undo my pants with just your mouth. You have two minutes",
"Put a blindfold on and guess which part of my body you’re kissing",
"Do something with me that you’ve been wanting to do since we started playing",
"In detail, describe what I look like when I orgasm",
"Pick one item you’d want to restrain me with next time we have sex",
"Write me a love letter. I can’t read it until the game is over",
"You have 60 seconds: try to turn me on using just your mouth",
"Show me a picture of someone we know that you’d like to bring in for a threesome",
"Go pick out your favorite set of lingerie that I own",
"Pick a steamy movie for us to watch tonight",
"Pick the first five songs of our joint sex playlist",
"Pick out a new sex position that you’ve been wanting to try",
"Kiss a part of my body that you think needs extra TLC",
"Grab an ice cube and drag it anywhere along my body until it melts",
"Show me a sexy photo of yourself that I’ve never seen before",
"In detail, describe how you like to masturbate",
"Be my photographer and help me take a sexy photo that only you can keep",
"Do your best twerking moves for 20 seconds",
"Kiss me upside down like Mary Jane kissed Spiderman",
"With your tongue, write a word that describes me on my back",
"Use your finger to write your name on your favorite part of my body",
"Pick up my finger or hand and show me how you like to receive oral sex",
"Kiss me anywhere you want",
"Give me a 30-second lap dance. (Both husband and wife should try this)",
"Use your fingers to trace over your favorite parts of my body",
"Hold my hand while you kiss me for 20 seconds",
"Lick my back and form a word you want me to guess",
"Suck on my belly button",
"Kiss your way down my back or stomach",
"Massage me with oil any way you choose for 30 seconds",
"Snuggle me how you like for 20 seconds",
"Stimulate two parts of my body at once. Use your hands on one part and your lips on the other",
"Take a sexy selfie and text it to me right now",
"Show me the part of your body that you think I find the sexiest",
"Kiss me with your eyes open for 30 seconds",
"You’re dared to describe the way I taste",
"Show me a toy you are curious about, but also a little nervous to try",
"Find an adult film with some moves you’d like to try and show it to me",
"Close your eyes and guess which body part I’m of mine about to press up against you",
"Allow me to film oral, for 15 seconds",
"Count my teeth with your tongue",
"Undress (I will too) and look into my eyes without touching me at all for 1 minute (or as long as we can)",
"Play the ice game with me. *Makeout with ice until it melts*",
"Let me play with an ice cube in your belly button",
"Try something new! If this ends up being that last dare of the game, you gotta try whatever position your partner wants.",
"Send your partner's family member a text how good they are in bed.",
"Don't pull out, show them your commitment.",
"Feed each other a dessert without using your hands.",
"Give your partner a 5-minute massage focusing on wherever they choose.",
"Slow dance together to a song of your partner's choosing, even if there's no music playing.",
"Take turns blindfolding each other and identifying objects by touch only.",
"Share a secret you've never told anyone else.",
"Create a cocktail or drink for your partner based on their personality.",
"Take turns drawing each other's portrait while maintaining eye contact the whole time.",
"Share the fantasy date you'd take your partner on if money was no object.",
"Play a game of truth or dare, but every truth must be something your partner doesn't know yet.",
"Take a shower or bath together (just washing, nothing more).",
"Write down three things you find irresistible about your partner and read them aloud.",
"Have a 60-second kiss without using your hands.",
"Take turns feeding each other ice cubes in creative ways.",
"Create a playlist of songs that remind you of your relationship and dance to one together.",
"Give your partner a compliment for every article of clothing they're wearing.",
"Take turns sharing your favorite memory of your relationship so far.",
"Recreate your first date in your living room.",
"Take turns whispering something in your partner's ear that you've always wanted to try together.",
"Spend 5 minutes exploring your partner's hands with your fingers and lips.",
"Have a staring contest where the loser grants a wish to the winner.",
"Take turns naming parts of your partner's body and explaining why you appreciate them.",
"Share the moment you realized you were falling for your partner.",
"Play a board game where the winner gets to choose the next activity.",
"Give your partner a full-body hug for 60 seconds straight.",
"Feed each other a meal blindfolded.",
"Take turns doing your best impression of each other.",
"Share one thing you'd like to try together that you've been too shy to suggest.",
"Have a pillow fight that ends with 30 seconds of cuddling.",
"Take turns kissing each of your partner's fingers, one by one.",
"Create a 'coupon book' of favors you're willing to do for your partner.",
"Show your partner how you'd kiss them if it was your first time again.",
"Play a game where one partner can only give instructions and the other must follow them blindfolded.",
"Take turns giving each other three gentle bites anywhere you choose.",
"Share a fantasy you have that involves your partner.",
"Take turns using an ice cube to trace a path on each other's skin.",
"Describe your partner's body using only food analogies.",
"Give each other pet names that you'll use for the rest of the night.",
"Have a thumb wrestling match where the winner gets a 30-second kiss.",
"Write 'I love you' on your partner using your finger, and see if they can guess what you wrote.",
"Describe what you find most attractive about your partner that isn't physical.",
"Play 'Simon Says' with increasingly intimate actions.",
"Whisper the lyrics of a love song in your partner's ear.",
"Feed each other your favorite snack with no hands.",
"Take turns naming things that turn you on about your partner.",
"Play a game of 'hot and cold' where your partner has to find an object you've hidden.",
"Recreate your favorite movie kiss scene.",
"Share something you've always wanted to try but have been too nervous to suggest.",
"Take turns telling each other a 60-second bedtime story.",
"Play rock-paper-scissors where the winner removes one item of the loser's clothing.",
"Give your partner a compliment for every year you've known them.",
"Trace the outline of your partner's body with your fingertips.",
"Share the first thing you noticed about your partner when you met.",
"Describe your perfect romantic evening together in detail.",
"Take turns demonstrating your favorite way to be kissed.",
"Do 10 push-ups with your partner lying underneath you.",
"Share something you've learned from your partner that has made you better.",
"Take turns giving compliments, and each one must start with the next letter of the alphabet.",
"Whisper three things in your partner's ear: one true, one false, and one fantasy.",
"Give your partner a back massage using only your forearms.",
"Share your three favorite physical attributes of your partner.",
"Take turns doing body shots off each other (with any beverage).",
"Write a haiku about your love life and recite it dramatically.",
"Play a game of 'two truths and a lie' about fantasies you have.",
"Demonstrate how you'd approach your partner if you were meeting them for the first time now.",
"Take turns kissing a path from your partner's hand to their neck.",
"Share the song that makes you think of your partner and why.",
"Feed your partner their favorite food in the most seductive way possible.",
"Describe your partner's kissing style using only movie titles.",
"Take turns giving each other a 30-second neck massage.",
"Share the most memorable intimate moment you've had together.",
"Play a game of 'follow the leader' where you must mirror everything your partner does.",
"Whisper the thing you find most irresistible about your partner.",
"Take turns tracing letters on each other's back to spell a message.",
"Share the outfit you find most attractive on your partner.",
"Try to make your partner laugh while they try to maintain a serious face.",
"Take turns demonstrating your best seductive dance move.",
"Share something new you'd like to learn together as a couple.",
"Take turns naming a body part, and your partner must kiss it.",
"Describe your partner's scent and why you love it.",
"Play 'never have I ever' with actions instead of words.",
"Take turns feeding each other something sweet in the most creative way possible.",
"Share a dream or fantasy you've had that involved your partner.",
"Give your partner a foot massage while maintaining eye contact.",
"Demonstrate three different types of kisses and have your partner rate them.",
"Share the moment in your relationship when you felt the strongest connection.",
"Take turns removing one item of each other's clothing while sharing what you love about them.",
"Tell your partner about a time they made you feel especially loved.",
"Play a game of 'guess the touch' where your partner must identify what body part is touching them.",
"Share the risks you'd be willing to take for your partner.",
"Take turns giving each other butterfly kisses (eyelash kisses) on different parts of the body.",
"Describe how your partner makes you feel using only three words.",
"Create an improvised poem about your partner's eyes.",
"Take turns naming something you want your partner to do more often.",
"Share the most unexpected thing you've learned about relationships from being with your partner.",
"Give your partner a shoulder massage while they share what's stressing them out.",
"Take turns demonstrating a new kiss you'd like to try more often.",
"Share what you believe your partner's love language is and why.",
"Play a game of 'guess the scent' while blindfolded.",
"Take turns sharing what you believe is your best physical feature and why.",
"Create a 5-minute story about your future together.",
"Give your partner a 'fresh eyes' compliment—something you notice now that you didn't at first.",
"Take turns demonstrating how you'd approach each other in a parallel universe where you're strangers.",
"Share the first thing you think about when you wake up next to your partner.",
"Play a game where you can only communicate with your hands for 5 minutes.",
"Take turns naming a place in the house where you'd like to be more intimate.",
"Share something vulnerable that you've never told your partner before.",
"Give your partner a 30-second kiss without touching them anywhere else.",
"Take turns naming your partner's habits that you secretly find endearing.",
"Share the most romantic gesture you can imagine your partner doing.",
"Play 'hot hands' where the winner gets to kiss wherever they choose.",
"Take turns giving each other a sensual arm massage.",
"Share what you think your partner's best quality as a lover is.",
"Create a blindfolded taste test of different foods or drinks for your partner.",
"Take turns naming something new you'd like to try together in the bedroom.",
"Share what made you certain this relationship was special.",
"Play a game of 'follow my finger' where your partner's eyes must follow your finger's movement.",
"Take turns demonstrating your interpretation of the perfect hug.",
"Share a time when your partner made you feel incredibly desired.",
"Create a quick impromptu dance and teach it to your partner.",
"Take turns naming your favorite physical feature of your partner that others might not notice.",
"Share how your definition of love has changed since being with your partner.",
"Give each other a 60-second face massage using only your thumbs.",
"Take turns completing the sentence: 'I feel closest to you when...'",
"Share what you believe would be your partner's perfect romantic evening.",
"Play a game of body part charades, where you can only use gestures to name a body part.",
"Take turns naming something you want to be better at for your partner.",
"Share what song reminds you of your first intimate moment together.",
"Give your partner a kiss for every month you've been together.",
"Take turns naming something you admire about how your partner loves you.",
"Share what you think your partner needs to hear more often from you.",
"Create a secret signal that only the two of you will understand when in public.",
"Take turns naming one boundary you'd like to explore together.",
"Share the most underrated intimate moment you've had together.",
"Play a game where you trace a word on your partner's back and they have to guess it.",
"Take turns naming something you've always appreciated about your partner but never said.",
"Share what movie scene reminds you of your relationship.",
"Give your partner a compliment for every color they're wearing.",
"Take turns naming a new romantic gesture you'd like to try.",
"Share what you believe is the foundation of your relationship's strength.",
"Create a 30-second skit about how you'll still be in love in 40 years.",
"Take turns leading each other in a slow dance with your bodies always touching.",
"Share what you believe your partner dreams about most often.",
"Write an acrostic poem using your partner's name, with each line being something you love about them.",
"Take turns sharing what you believe is your most attractive feature during intimate moments.",
"Share what you would still love about your partner if you lost all your other senses.",
"Create a signature cocktail that represents your relationship and enjoy it together."
  ]
  