[
    "Sing the chorus of your favorite song in a funny voice.",
"Talk like a robot for the next two rounds.",
"Do your best chicken dance for 30 seconds.",
"Wear socks on your hands for the next three turns.",
"Call a family member and tell them a silly joke.",
"Balance a spoon on your nose for 15 seconds.",
"Pretend to be a cat and crawl around the room for a minute.",
"Try to lick your elbow.",
"Make the funniest face you can and hold it for 10 seconds.",
"Spin in a circle 10 times and then walk in a straight line.",
"Act like you’re on a cooking show and narrate making a silly dish.",
"Hop on one foot while singing 'Twinkle Twinkle Little Star.'",
"Draw a mustache on your face with a washable marker or face paint.",
"Try to say the alphabet backward as fast as you can.",
"Put on as many layers of clothing as you can in 60 seconds.",
"Give everyone in the room a high-five… with your feet!",
"Pretend you’re a superhero and strike your coolest poses.",
"Attempt to juggle three random objects (soft ones like socks or toys).",
"Wrap yourself in toilet paper like a mummy.",
"Imitate someone in the family without saying who it is and let others guess.",
"Do 10 jumping jacks while barking like a dog.",
"Act like a statue for the next two turns—no moving or speaking!",
"Wear a silly hat (or make one from paper) for the rest of the game.",
"Do your best impression of a baby crying for 15 seconds.",
"Try to do a cartwheel (or your funniest attempt at one).",
"Pretend to eat an invisible sandwich and describe it in detail.",
"Speak in an accent of your choice for the next two turns.",
"Do a runway walk across the room.",
"Pretend to be a pirate and talk like one for the next round.",
"Try to do a handstand or your best attempt.",
"Draw something blindfolded and let others guess what it is.",
"Sing everything you say for the next two rounds.",
"Pretend to swim on the floor for 30 seconds.",
"Bounce a balloon in the air and keep it up for one minute.",
"Hold your breath for as long as you can.",
"Clap your hands 50 times as fast as you can.",
"Pretend to play an imaginary instrument of your choice.",
"Run around the outside of the house yelling, 'I’m the best!'",
"Spell your name backward out loud.",
"Pretend to ride a horse for 30 seconds.",
"Do your best slow-motion impression of running.",
"Stack five pillows on top of your head and walk across the room.",
"Talk like a baby for the next two turns.",
"Try to touch your toes without bending your knees.",
"Act like you’re stuck in a box for 30 seconds.",
"Do your best monkey impression.",
"Pretend to be a waiter and take someone’s imaginary order.",
"Sing the national anthem in a funny voice.",
"Walk backward for the next three turns.",
"Pretend to sneeze continuously for 10 seconds.",
"Do a silly dance for one minute with no music.",
"Try to whistle your favorite song.",
"Act like a fish out of water for 15 seconds.",
"Pretend to be a news anchor and report fake news.",
"Speak only in rhymes for the next round.",
"Act like a famous movie character and let others guess who it is.",
"Do 10 sit-ups while making silly noises.",
"Put a book on your head and try to walk across the room without dropping it.",
"Pretend to ride an invisible skateboard for 30 seconds.",
"Make animal noises for the next two turns.",
"Walk on your knees until your next turn.",
"Pretend to take a selfie and make a silly face.",
"Do your best impression of a duck quacking.",
"Try to balance on one leg for 30 seconds.",
"Play air guitar and sing along to an imaginary rock song.",
"Pretend to fly like an airplane for one minute.",
"Do a cartwheel attempt while yelling 'ta-da!' at the end.",
"Eat an imaginary bowl of soup and describe how it tastes.",
"Mimic the person to your right for one turn.",
"Pretend to be a zombie for 30 seconds.",
"Try to juggle two soft objects.",
"Pretend to do a magic trick and explain it dramatically.",
"Sing like an opera singer for 10 seconds.",
"Try to do a belly dance for 15 seconds.",
"Pretend you’re walking on a tightrope for 20 seconds.",
"Play peek-a-boo with someone for 30 seconds.",
"Pretend to be a weather reporter and give a weather update.",
"Act like a rock star and perform a song.",
"Pretend you’re a frog and hop around the room for 30 seconds.",
"Try to talk with your tongue sticking out for the next two rounds.",
"Pretend to run a marathon in slow motion.",
"Wrap a blanket around you like a cape and pretend to be a superhero.",
"Pretend to conduct an orchestra for 15 seconds.",
"Spin around 5 times and try to walk in a straight line.",
"Pretend to be a robot for 20 seconds.",
"Do 10 push-ups while making silly noises.",
"Pretend to be a chef and make an imaginary meal.",
"Pretend to be a teacher and explain something silly.",
"Do your best impression of a chicken for 15 seconds.",
"Sing the chorus of your favorite song.",
"Balance a book on your head and walk across the room.",
"Do 10 jumping jacks.",
"Make a paper airplane and see how far you can throw it.",
"Draw a picture with your eyes closed.",
"Tell a joke that makes everyone laugh.",
"Speak in an accent for the next two minutes.",
"Make a silly face and hold it for 15 seconds.",
"Hop on one foot for 30 seconds.",
"Recite the alphabet backwards.",
"Do your best robot dance.",
"Pretend to be a statue for one minute.",
"Make up a short rhyme about someone in the room.",
"Balance on one foot for 30 seconds.",
"Try to lick your elbow.",
"Do your best impression of a famous cartoon character.",
"Try to say a tongue twister three times fast.",
"Make up a new handshake with the person next to you.",
"Speak in slow motion for 30 seconds.",
"Pretend to be a tour guide for the room you're in.",
"Do your best impression of a monkey.",
"Try to make a paper ball into a trash can from 6 feet away.",
"Wrap yourself in toilet paper like a mummy for one minute.",
"Pretend to be underwater for 30 seconds.",
"Do your best impression of someone else in the room.",
"Say 'purple pickled peppers' five times fast.",
"Pretend to be a runway model and walk across the room.",
"Do 5 push-ups.",
"Make up a 15-second commercial for a random object in the room.",
"Talk to your thumb like it's a person for 30 seconds.",
"Make up a song about ice cream.",
"Pretend to be a news reporter and give a 30-second weather report.",
"Do the crab walk across the room.",
"Spin around 10 times and then try to walk in a straight line.",
"Speak without closing your mouth for one minute.",
"Make a paper hat and wear it for the next three rounds.",
"Pretend to be a superhero for one minute.",
"Do your best animal impression and have others guess what it is.",
"Invent and demonstrate a new dance move.",
"Make a funny face in your phone's selfie camera.",
"Act like you're in slow motion for 30 seconds.",
"Say the alphabet while doing jumping jacks.",
"Pretend to be a zombie for 30 seconds.",
"Do your best opera singing impression.",
"Try to stand on your tiptoes for one minute.",
"Tell a story using only sound effects.",
"Make up a secret handshake with someone in the room.",
"Do your best impression of a rock star playing guitar.",
"Speak in rhymes for one minute.",
"Draw something with your non-dominant hand.",
"Pretend you're stuck in a box for 30 seconds.",
"Try to whistle a tune that others can recognize.",
"Do a silly walk across the room.",
"Make an origami creation in two minutes.",
"Try to juggle with three small objects.",
"Act out your favorite movie scene without words.",
"Do 10 star jumps.",
"Pretend to be a character from a fairy tale for one minute.",
"Balance three objects on your palm for 30 seconds.",
"Make a funny noise every time someone says your name for the next three rounds.",
"Speak without using the letter 'e' for one minute.",
"Create a rap about your day.",
"Do the moonwalk across the room.",
"Act like you're riding a rollercoaster for 30 seconds.",
"Spell your name with your body.",
"Make a tower using only items in your pockets.",
"Pretend to be a T-Rex with tiny arms for one minute.",
"Recite a nursery rhyme with emotion (happy, sad, angry, etc.).",
"Try to touch your nose with your tongue.",
"Pretend to be a robot running out of batteries.",
"Draw something on someone's back and have them guess what it is.",
"Make up a cheer about the person to your left.",
"Do your best impression of a sports announcer.",
"Try to name 10 animals in 20 seconds.",
"Show everyone your best dance move.",
"Speak as if everything is a question for one minute.",
"Pretend to be a mime stuck in a box.",
"Do your best impression of a laugh from a TV show or movie.",
"Make a paper fortune teller in three minutes.",
"Create a secret greeting that everyone must use for the rest of the game.",
"Pretend to conduct an orchestra for 30 seconds.",
"Try to do a cartwheel (only if there's enough space and it's safe).",
"Act out a scene where you're caught in a rainstorm without an umbrella.",
"Try to balance a spoon on your nose for 15 seconds.",
"Make three animal sounds in a row.",
"Pretend to be a snowflake falling from the sky.",
"Create a short commercial for your favorite snack.",
"Do your best impression of someone famous.",
"Try to do five jump rope jumps with an imaginary rope.",
"Make up a short story about a magical talking pet.",
"Sing 'Happy Birthday' in a whisper.",
"Pretend to be a chef making your favorite meal.",
"Create a new holiday and explain what it celebrates.",
"Do your best impression of a grumpy old person.",
"Pretend you're in an invisible box for 30 seconds."
  ]
  