[
"Sing the chorus of your favorite song at full volume.",
"Pretend you’re auditioning for a Broadway musical with a made-up song.",
"Air guitar your favorite rock song for 20 seconds.",
"Whistle the melody of a popular song and see if anyone can guess it.",
"Perform an interpretive dance to an imaginary piece of classical music.",
"Hum the tune of a Disney song and let others guess the title.",
"Rap your next sentence like you’re Eminem.",
"Pretend to be a conductor and ‘conduct’ an invisible orchestra.",
"Sing ‘Happy Birthday’ in the style of a famous pop artist.",
"Create a drum solo using only items on the table.",
"Lip-sync a popular song with exaggerated moves.",
"Pretend to be a jazz musician introducing their next big hit.",
"Sing a song that contains the word ‘love’ in it.",
"Use your drink or a pen as a microphone and pretend to be a famous singer giving an interview.",
"Do your best opera impression for 15 seconds.",
"Name 5 Broadway musicals in under 10 seconds—or sing a snippet from one!",
"Create and perform a short jingle about something random in the room.",
"Pretend to play an imaginary saxophone while moving across the room.",
"Imitate your favorite music artist and have others guess who it is.",
"Sing a famous song, but only use the word ‘la’ for all the lyrics.",
"Perform a quick dance routine to a song someone else picks.",
"Beatbox for 10 seconds, no matter how it sounds.",
"Pretend to be a DJ introducing the next hit song.",
"Use only your hands to drum out the beat of a song and see if others can guess it.",
"Sing a line from a Broadway song in your most dramatic voice.",
"Use office supplies or items nearby to ‘create’ an instrument and play it.",
"Imitate a backup dancer and perform behind someone else.",
"Pretend to be a famous pop star at a press conference.",
"Mash up two songs by singing lines from both at the same time.",
"Play the air piano and belt out an Elton John classic.",
"Sing a lullaby like a heavy metal singer.",
"Hum a Beatles song and let others guess which one it is.",
"Pretend to audition for *American Idol* and introduce yourself to the judges.",
"Recite a song’s lyrics as if it were a dramatic poem.",
"Dance like you’re on stage performing in a Broadway show.",
"Sing a country song with an exaggerated Southern accent.",
"Pretend to be a rock star trashing their hotel room—but only with imaginary objects.",
"Write and perform a two-line rap about something in the room.",
"Pretend to be a musical theater director and coach someone else in the room.",
"Name five instruments in under 10 seconds—or hum a tune with your favorite one!",
"Sing a song, but swap out the real lyrics for gibberish.",
"Pretend to be a famous composer explaining their latest masterpiece.",
"Use only gestures to act out your favorite song.",
"Sing a Disney song in the style of a Broadway performer.",
"Name five artists or bands from the '80s—or dance to an imaginary synth beat.",
"Perform a line from *Les Misérables* with as much emotion as possible.",
"Mime playing a violin while pretending you’re in a dramatic scene.",
"Name three songs by Taylor Swift—or do a dramatic reading of one of her lyrics.",
"Pretend you’re on stage at Coachella and perform for the group.",
"Sing a famous song backward—start with the last line and work your way to the beginning.",
"Act like you’re in a karaoke battle and give it your all.",
"Pretend to be a Broadway usher giving directions to guests.",
"Sing the alphabet song to the tune of *Twinkle, Twinkle, Little Star*.",
"Imitate the voice of your favorite singer performing their hit song.",
"Perform a dramatic mic drop after delivering a made-up speech.",
"Do your best moonwalk across the room.",
"Create a silly remix of a nursery rhyme.",
"Pretend you’re in an acapella group and perform a one-person harmony.",
"Sing ‘Let It Go’ from *Frozen* with as much drama as possible.",
"Name three famous musicals—or perform a dance from one.",
"Pretend to play the drums during a stadium rock concert.",
"Write and perform a one-line parody of a famous love song.",
"Sing ‘Old McDonald Had a Farm’ but replace the animals with musical instruments.",
"Mime being a street performer singing for tips.",
"Pretend to play the flute solo from *My Heart Will Go On*.",
"Act like you’re auditioning for *The Voice* and explain why they should pick you.",
"Sing ‘Row, Row, Row Your Boat’ in a completely new melody.",
"Pretend to conduct a choir while humming a well-known hymn.",
"Act out a dramatic breakup scene inspired by a country song.",
"Pretend you’re hosting a radio show and introduce a song.",
"Do a mash-up of three famous Broadway songs in 15 seconds.",
"Sing ‘We Will Rock You’ but only clap and stomp.",
"Pretend you’re a famous rapper and deliver a freestyle about coffee.",
"Sing a Christmas carol, even if it’s not the season.",
"Mime holding a microphone while delivering an emotional ballad.",
"Pretend to be an opera singer performing their grand finale.",
"Use your phone as a prop and act out a silent TikTok performance.",
"Make up a song about the group you’re with and perform it.",
"Create a fake theme song for your life and sing it.",
"Perform a fake commercial jingle for an imaginary product.",
"Pretend to be a Broadway actor auditioning for *The Phantom of the Opera*.",
"Act out an epic guitar solo from a rock anthem.",
"Imitate a classical musician playing their instrument with great flair.",
"Host an imaginary karaoke night and sing the opening act.",
"Pretend to be a jazz singer introducing their band members.",
"Sing a famous line from a song and change the lyrics to something silly.",
"Act like you’re a famous DJ hyping up the crowd.",
"Perform a silent dance inspired by your favorite musical genre.",
"Hum your favorite Broadway song while walking across the room dramatically.",
"Pretend to play the triangle in an orchestra and act like it’s a huge deal.",
"Do your best impression of a singer forgetting the lyrics mid-performance.",
"Act like you’ve just won a Grammy and give an emotional acceptance speech.",
"Mimic a famous music video dance and let others guess which one.",
"Pretend to be a backup singer and perform exaggerated dance moves.",
"Sing the first line of 5 different songs in 30 seconds.",
"Pretend you’re auditioning for a boy band and show off your best dance moves.",
"Sing the national anthem as if you’re performing at the Super Bowl.",
"Create a beat using only your hands and feet, then freestyle over it.",
"Imitate a famous Broadway character delivering a dramatic monologue in song.",
"Pretend to play the tambourine while performing an over-the-top dance.",
"Hum a popular song and have others guess what it is.",
"Pretend to play air guitar to an imaginary rock song for 30 seconds.",
"Sing the chorus of your favorite song right now.",
"Do an impression of a famous music artist.",
"Create a beat using only sounds you can make with your body for 20 seconds.",
"Make up a short jingle about the person to your right.",
"Name three songs with the word 'love' in the title in 15 seconds.",
"Sing 'Twinkle Twinkle Little Star' in an opera style.",
"Perform an interpretive dance to an imaginary classical song.",
"Try to recite the lyrics to your national anthem.",
"Pretend to be a conductor leading an orchestra for 30 seconds.",
"Beatbox for 20 seconds.",
"Do your best air drums solo.",
"Make up a rap about your day.",
"Sing your response to the next question you're asked.",
"Dance like you're at a 70s disco for 20 seconds.",
"Name five musical instruments in 10 seconds.",
"Perform a dance move that best represents your personality.",
"Create a song title using three random words from others in the room.",
"Compose a short 15-second melody about friendship.",
"Try to speak in a rhythm for 30 seconds.",
"Act out a music video in 30 seconds.",
"Whistle a tune and have others guess what song it is.",
"Sing 'Happy Birthday' as if you're underwater.",
"Try to name 10 music genres in 15 seconds.",
"Create instrument sounds with your mouth for 20 seconds.",
"Dance to a song only you can hear for 30 seconds.",
"Sing a lullaby in a whisper.",
"Make up a short song about your favorite food.",
"Pretend to be a pop star in a music video.",
"Do the robot dance for 15 seconds.",
"Create a handshake that goes with an imaginary beat.",
"Try to clap along with a rhythm someone else creates.",
"Pretend to be a backup dancer for 30 seconds.",
"Hum the theme song from your favorite TV show.",
"Create lyrics for a song about this game.",
"Try to sing while holding your nose.",
"Move around the room as if you're a music note floating through the air.",
"Do a moonwalk or attempt to.",
"Sing in a style opposite to what you normally would (if you like pop, try opera, etc.).",
"Pretend to DJ for 30 seconds, complete with sound effects.",
"Create a new dance move and name it.",
"Try to hit the highest note you can.",
"Drum a beat on the table and have someone dance to it.",
"Sing a children's song in a rock style.",
"Name three songs that make you happy in 10 seconds.",
"Create a jingle for an imaginary product.",
"Try to speak like you're rapping for 30 seconds.",
"Start a mini conga line and get others to join for 15 seconds.",
"Pretend you're playing a saxophone for 20 seconds.",
"Sing a song but replace the lyrics with 'la la la'.",
"Create a short song about the weather today.",
"Pretend you're at a concert and act like an excited fan for 20 seconds.",
"Try to sing a song backwards.",
"Do the dance to a popular TikTok song (or make one up).",
"Hum the melody to 'Happy Birthday' while doing jumping jacks.",
"Pretend you're playing a violin concerto.",
"Try to name five famous bands or musicians in 10 seconds.",
"Sing as if you're in a musical where everything is dramatically sung.",
"Create a rhythm by tapping on different objects around you.",
"Dance as if you're in a music video from the 80s.",
"Try to harmonize with someone else in the room.",
"Create sound effects for an imaginary movie scene.",
"Name a song that would be the soundtrack to your life.",
"Try to mimic the sound of three different instruments.",
"Make up a short country song about something in the room.",
"Pretend to crowd surf for 15 seconds.",
"Sing through your next three responses.",
"Try to create a song using only one word.",
"Dance to different genres as someone calls them out for 30 seconds.",
"Pretend to play a piano concerto.",
"Make up a short song using the names of people in the room.",
"Sing a popular song in slow motion.",
"Create a superhero theme song for yourself.",
"Try to tap dance for 15 seconds (or your best approximation).",
"Recite the lyrics of your favorite song in a dramatic voice.",
"Move around as if music is controlling your body for 20 seconds.",
"Pretend to have a sing-off with an imaginary opponent.",
"Create a new theme song for a TV show you watch.",
"Try to imitate a famous band's performance style.",
"Dance as if you're in a ballet for 20 seconds.",
"Make up a song about the last thing you ate.",
"Try to name five music-related movies in 15 seconds.",
"Pretend you're a marching band member for 20 seconds.",
"Create a musical greeting that others must use for the rest of the game.",
"Try to harmonize with an imaginary duet partner.",
"Act out playing a musical instrument you've never played before.",
"Create a short song from the perspective of your shoe.",
"Sing a song while spinning in a circle.",
"Try to make up a sea shanty about today's adventures.",
"Pretend to stage dive for 10 seconds.",
"Create a five-second melody that represents how you're feeling.",
"Sing your favorite movie quote instead of saying it.",
"Dance like you're in a music box that's just been opened.",
"Try to create a song using only sounds from nature.",
"Make up new lyrics to a well-known melody.",
"Pretend you're lip-syncing to an epic power ballad."
  ]
  