[
    "Sing the chorus of your favorite song at full volume.",
    "Pretend you’re auditioning for a Broadway musical with a made-up song.",
    "Air guitar your favorite rock song for 20 seconds.",
    "Whistle the melody of a popular song and see if anyone can guess it.",
    "Perform an interpretive dance to an imaginary piece of classical music.",
    "Hum the tune of a Disney song and let others guess the title.",
    "Rap your next sentence like you’re Eminem.",
    "Pretend to be a conductor and ‘conduct’ an invisible orchestra.",
    "Sing ‘Happy Birthday’ in the style of a famous pop artist.",
    "Create a drum solo using only items on the table.",
    "Lip-sync a popular song with exaggerated moves.",
    "Pretend to be a jazz musician introducing their next big hit.",
    "Sing a song that contains the word ‘love’ in it.",
    "Use your drink or a pen as a microphone and pretend to be a famous singer giving an interview.",
    "Do your best opera impression for 15 seconds.",
    "Name 5 Broadway musicals in under 10 seconds—or sing a snippet from one!",
    "Create and perform a short jingle about something random in the room.",
    "Pretend to play an imaginary saxophone while moving across the room.",
    "Imitate your favorite music artist and have others guess who it is.",
    "Sing a famous song, but only use the word ‘la’ for all the lyrics.",
    "Perform a quick dance routine to a song someone else picks.",
    "Beatbox for 10 seconds, no matter how it sounds.",
    "Pretend to be a DJ introducing the next hit song.",
    "Use only your hands to drum out the beat of a song and see if others can guess it.",
    "Sing a line from a Broadway song in your most dramatic voice.",
    "Use office supplies or items nearby to ‘create’ an instrument and play it.",
    "Imitate a backup dancer and perform behind someone else.",
    "Pretend to be a famous pop star at a press conference.",
    "Mash up two songs by singing lines from both at the same time.",
    "Play the air piano and belt out an Elton John classic.",
    "Sing a lullaby like a heavy metal singer.",
    "Hum a Beatles song and let others guess which one it is.",
    "Pretend to audition for *American Idol* and introduce yourself to the judges.",
    "Recite a song’s lyrics as if it were a dramatic poem.",
    "Dance like you’re on stage performing in a Broadway show.",
    "Sing a country song with an exaggerated Southern accent.",
    "Pretend to be a rock star trashing their hotel room—but only with imaginary objects.",
    "Write and perform a two-line rap about something in the room.",
    "Pretend to be a musical theater director and coach someone else in the room.",
    "Name five instruments in under 10 seconds—or hum a tune with your favorite one!",
    "Sing a song, but swap out the real lyrics for gibberish.",
    "Pretend to be a famous composer explaining their latest masterpiece.",
    "Use only gestures to act out your favorite song.",
    "Sing a Disney song in the style of a Broadway performer.",
    "Name five artists or bands from the '80s—or dance to an imaginary synth beat.",
    "Perform a line from *Les Misérables* with as much emotion as possible.",
    "Mime playing a violin while pretending you’re in a dramatic scene.",
    "Name three songs by Taylor Swift—or do a dramatic reading of one of her lyrics.",
    "Pretend you’re on stage at Coachella and perform for the group.",
    "Sing a famous song backward—start with the last line and work your way to the beginning.",
    "Act like you’re in a karaoke battle and give it your all.",
    "Pretend to be a Broadway usher giving directions to guests.",
    "Sing the alphabet song to the tune of *Twinkle, Twinkle, Little Star*.",
    "Imitate the voice of your favorite singer performing their hit song.",
    "Perform a dramatic mic drop after delivering a made-up speech.",
    "Do your best moonwalk across the room.",
    "Create a silly remix of a nursery rhyme.",
    "Pretend you’re in an acapella group and perform a one-person harmony.",
    "Sing ‘Let It Go’ from *Frozen* with as much drama as possible.",
    "Name three famous musicals—or perform a dance from one.",
    "Pretend to play the drums during a stadium rock concert.",
    "Write and perform a one-line parody of a famous love song.",
    "Sing ‘Old McDonald Had a Farm’ but replace the animals with musical instruments.",
    "Mime being a street performer singing for tips.",
    "Pretend to play the flute solo from *My Heart Will Go On*.",
    "Act like you’re auditioning for *The Voice* and explain why they should pick you.",
    "Sing ‘Row, Row, Row Your Boat’ in a completely new melody.",
    "Pretend to conduct a choir while humming a well-known hymn.",
    "Act out a dramatic breakup scene inspired by a country song.",
    "Pretend you’re hosting a radio show and introduce a song.",
    "Do a mash-up of three famous Broadway songs in 15 seconds.",
    "Sing ‘We Will Rock You’ but only clap and stomp.",
    "Pretend you’re a famous rapper and deliver a freestyle about coffee.",
    "Sing a Christmas carol, even if it’s not the season.",
    "Mime holding a microphone while delivering an emotional ballad.",
    "Pretend to be an opera singer performing their grand finale.",
    "Use your phone as a prop and act out a silent TikTok performance.",
    "Make up a song about the group you’re with and perform it.",
    "Create a fake theme song for your life and sing it.",
    "Perform a fake commercial jingle for an imaginary product.",
    "Pretend to be a Broadway actor auditioning for *The Phantom of the Opera*.",
    "Act out an epic guitar solo from a rock anthem.",
    "Imitate a classical musician playing their instrument with great flair.",
    "Host an imaginary karaoke night and sing the opening act.",
    "Pretend to be a jazz singer introducing their band members.",
    "Sing a famous line from a song and change the lyrics to something silly.",
    "Act like you’re a famous DJ hyping up the crowd.",
    "Perform a silent dance inspired by your favorite musical genre.",
    "Hum your favorite Broadway song while walking across the room dramatically.",
    "Pretend to play the triangle in an orchestra and act like it’s a huge deal.",
    "Do your best impression of a singer forgetting the lyrics mid-performance.",
    "Act like you’ve just won a Grammy and give an emotional acceptance speech.",
    "Mimic a famous music video dance and let others guess which one.",
    "Pretend to be a backup singer and perform exaggerated dance moves.",
    "Sing the first line of 5 different songs in 30 seconds.",
    "Pretend you’re auditioning for a boy band and show off your best dance moves.",
    "Sing the national anthem as if you’re performing at the Super Bowl.",
    "Create a beat using only your hands and feet, then freestyle over it.",
    "Imitate a famous Broadway character delivering a dramatic monologue in song.",
    "Pretend to play the tambourine while performing an over-the-top dance."
  ]
  