[
    "Do your best impression of the boss for 30 seconds.",
    "Email yourself a motivational quote and read it out loud to the team.",
    "Take a selfie with everyone in the room and send it to the office group chat.",
    "Do 10 jumping jacks in the middle of the room.",
    "Pretend to type furiously on your keyboard while making typing sound effects.",
    "Write and deliver a 1-minute fake acceptance speech for ‘Employee of the Year.’",
    "Balance a pencil on your nose for 10 seconds.",
    "Give an over-the-top weather report about today’s office conditions.",
    "Use office supplies to create a hat and wear it for the next round.",
    "Start every sentence with ‘According to my calculations’ for the next 5 minutes.",
    "Walk across the room while pretending to be on an invisible tightrope.",
    "Introduce yourself to someone as if you’re meeting for the first time, even if you already know them.",
    "Make up a jingle for the office and sing it to the group.",
    "Do your best dramatic reading of an office email.",
    "Lead a 30-second stretching session for everyone.",
    "Act out a scene from a famous movie—no talking allowed, only gestures.",
    "Compliment three people on their shoes without explaining why.",
    "Balance a book (or folder) on your head and walk across the room.",
    "Speak in a robot voice until your next turn.",
    "Write a funny (but professional!) email subject line and read it out loud.",
    "Use your best announcer voice to introduce the next player.",
    "Take a sip of your drink while holding the cup like it’s the fanciest thing ever.",
    "Host an impromptu ‘productivity hack’ seminar in 30 seconds.",
    "Mime making a cup of coffee from start to finish.",
    "Spin in a circle 10 times and then try to walk in a straight line.",
    "Pretend to give a TED Talk about how to survive Mondays at work.",
    "Tape a sticky note on your forehead that says ‘Ask Me Anything’ for the next 5 minutes.",
    "Give your chair a name and introduce it to the group.",
    "Clap after everything anyone says until your next turn.",
    "Pretend to be a superhero whose power is organizing office supplies.",
    "Act like a customer calling tech support about a ‘broken stapler.’",
    "Swap chairs with someone for one round.",
    "Create and deliver a 10-second sales pitch for a random object on your desk.",
    "Pretend you’re on a cooking show and describe how to make a peanut butter sandwich—no hands allowed.",
    "Act out your morning routine at work like it’s a choreographed dance.",
    "Compliment three coworkers on their typing speed.",
    "Pretend to take an imaginary phone call and make it as dramatic as possible.",
    "Draw a picture of your favorite coworker in under 20 seconds and show the group.",
    "Start your next sentence with ‘Breaking news!’ no matter the topic.",
    "Pretend you’re on a game show and someone just won a huge prize—react accordingly.",
    "Use your drink or coffee mug as a microphone and interview someone in the room.",
    "Sing your favorite office-themed song for 10 seconds.",
    "Give a weather report about the state of the office printer.",
    "Balance three random objects from your desk in one hand for 10 seconds.",
    "Pretend you’re an airplane and ‘fly’ around the room for 10 seconds.",
    "Speak in rhyme until your next turn.",
    "Draw a picture of your boss and present it to the group as abstract art.",
    "Do your best impression of the office coffee machine.",
    "Pretend to be a traffic director and guide people walking around the room for 30 seconds.",
    "Act like you’re giving a guided tour of the office to an imaginary VIP guest.",
    "Use a random object on your desk as a prop and pretend you’re a TV salesperson.",
    "Teach the group a ridiculous handshake and make someone try it with you.",
    "Pretend you’re a statue until your next turn.",
    "Make up a dance move based on something in the office (e.g., ‘The Copier Shuffle’).",
    "Host a 30-second fake ‘press conference’ about your biggest work accomplishment.",
    "Pretend to write a heartfelt thank-you note to the office coffee machine.",
    "Pretend to ‘fix’ a broken imaginary object like it’s a huge deal.",
    "Use only gestures to describe your job to the group.",
    "Narrate your actions like you’re a character in an office drama.",
    "Do your best impression of a coworker (in a fun and kind way!).",
    "Act like you’ve just won a ‘Best Office Desk’ award—give a short acceptance speech.",
    "Make an exaggerated, slow-motion version of your daily commute to your desk.",
    "Use sticky notes to create a fashion accessory and wear it.",
    "Pretend you’re on a cooking show describing how to ‘cook’ an office stapler.",
    "Create a silly slogan for the office and chant it for 10 seconds.",
    "Walk around the room like you’re modeling for an office supply catalog.",
    "Use your best spy voice to narrate your day so far.",
    "Act out your email inbox as if it’s a soap opera plot.",
    "Pretend to be a famous CEO giving a motivational speech.",
    "Make up a theme song for the office printer and hum it.",
    "Pretend you’re a fitness instructor leading a ‘deskercise’ class.",
    "Do a dramatic re-enactment of sending an important email.",
    "Pretend you’re an auctioneer trying to sell an office chair.",
    "Create a superhero alter ego based on your role in the office.",
    "Use only emojis to explain your job for the next 30 seconds.",
    "Pretend to take a selfie with the entire room and give it a quirky caption.",
    "Make up a short poem about the office water cooler.",
    "Pretend the floor is lava and find a way to cross the room safely.",
    "Create a motivational chant for your team and teach it to everyone.",
    "Act like you’re writing a bestseller called *The Secrets of the Perfect Office Day*.",
    "Do your best impression of a computer loading screen.",
    "Invent a ridiculous new office policy and explain it with a straight face.",
    "Pretend to read an important memo from ‘Corporate’ with a serious tone.",
    "Act like you’ve just solved the office’s biggest mystery and share the ‘case.’",
    "Use office supplies to build the tallest structure you can in 1 minute.",
    "Pretend to be the IT department explaining how to fix a ‘frozen mouse.’",
    "Host a mock award ceremony and give a made-up award to someone in the room.",
    "Do your best impression of a robot coworker.",
    "Pretend you’re running for ‘Office President’ and give a quick campaign speech.",
    "Create a silly new job title for yourself and introduce it to the group.",
    "Pretend you’re on a cooking competition show and present your ‘signature dish’—a stapler."
  ]
  