[
"Wave enthusiastically at strangers and see who waves back.",
"Ask someone for directions to a completely made-up place.",
"Sing a random song out loud while walking down the street.",
"Pretend to be a statue for 30 seconds in a busy area.",
"Stand in a line, even if there’s no reason for it, and see if others join.",
"Walk backward for 10 steps and act like it’s normal.",
"Clap and cheer when someone exits a store.",
"Ask someone nearby to take a picture of you in a silly pose.",
"Give a stranger a high five and say, ‘Great job today!’",
"Pretend you’re a tour guide and explain landmarks to imaginary tourists.",
"Do your best slow-motion run across a crosswalk.",
"Walk up to a vending machine and dramatically argue with it like it’s a person.",
"Hold an invisible microphone and interview someone about their ‘celebrity life.’",
"Dance for 10 seconds in the middle of a sidewalk.",
"Pretend to ‘catch’ an invisible ball someone else ‘throws’ to you.",
"Start singing a Disney song and see if anyone joins in.",
"Ask someone if they’ve seen your imaginary lost pet and describe it in detail.",
"Walk up to a tree and thank it for its service to the planet.",
"Ask someone if they know where the nearest unicorn rental is.",
"Pretend to sneeze loudly and say, ‘Wow, that’s the third time today I sneezed glitter!’",
"Walk around a store like you’re on a scavenger hunt for the silliest item.",
"Start a slow clap in a public area and see if others join.",
"Ask someone for their autograph and act like you’re starstruck.",
"Pretend to be looking for Wi-Fi and walk around holding your phone in random places.",
"Walk up to a stranger and compliment them on something random like their shoelaces.",
"Stand at a crosswalk and dramatically pretend to direct traffic.",
"Spin in a circle three times and then act dizzy while walking.",
"Walk through a park like you’re in a dramatic movie scene.",
"Start a fake phone conversation and say, ‘I can’t believe you bought a kangaroo!’",
"Pretend to get stuck in an invisible box and ask someone for help getting out.",
"Randomly point to the sky and look shocked—see if others look too.",
"Act like you’re filming a cooking show and explain how to cook air.",
"Ask a stranger if they’ve heard the good news and then tell them, ‘Tacos exist.’",
"Pretend to be looking for a hidden treasure and ask people if they’ve seen it.",
"Walk through a public area pretending to be on an important video call.",
"Dance across a crosswalk like it’s your personal stage.",
"Pretend you’re reporting live on breaking news and narrate what’s happening around you.",
"Walk into a store and ask if they sell invisible pens.",
"Pretend to take a selfie with someone random and thank them for being in your photo.",
"Act like you’re hosting a fitness class and lead an exercise routine in public.",
"Walk through a public area pretending to talk to an imaginary friend.",
"Wave at cars driving by like you’re in a parade.",
"Walk into a store and ask for directions to the moon.",
"Act like you’re stuck in slow motion while walking through a busy area.",
"Pretend you’re a traffic cone and stand still near a busy area.",
"Carry an imaginary heavy box and ask someone for help holding it.",
"Ask someone if they’ve ever been on TV and act impressed no matter what they say.",
"Point to an object and loudly declare, ‘This is EXACTLY what I’ve been looking for!’",
"Start clapping randomly in public and see if others join in.",
"Pretend to be a detective investigating a mysterious bench or statue.",
"Pretend to answer an invisible phone call and have a very animated conversation.",
"Walk around looking for ‘the floor is lava’ safe spots.",
"Approach someone and ask them what year it is, then act shocked at their answer.",
"Pretend you’re measuring the sidewalk with invisible tools.",
"Challenge a stranger to a rock-paper-scissors game.",
"Walk up to someone and ask if they’ve seen your ‘time-traveling companion.’",
"Sit on a park bench and narrate people’s actions like a nature documentary.",
"Start a fake weather report about the area you’re in.",
"Pretend you’re a robot and walk stiffly through a public area.",
"Ask someone to ‘autograph’ your hand and act very excited.",
"Pretend to get stuck in an invisible spider web and ask for help getting free.",
"Walk into a public space and loudly announce, ‘I have arrived!’",
"Pretend you’re searching for a secret door in a wall.",
"Ask a stranger if they’ve heard the new hit single and hum an imaginary tune.",
"Stand near a fountain and pretend to ‘fish’ with an invisible fishing pole.",
"Walk into a store and ask if they sell dragon food.",
"Pretend to practice your catwalk modeling skills on the sidewalk.",
"Walk up to someone and ask, ‘If you were a superhero, what would your power be?’",
"Ask someone if they know where to find the nearest unicorn.",
"Pretend to be a mime stuck in an invisible elevator.",
"Balance an imaginary book on your head and walk gracefully through a busy area.",
"Pretend you’re giving a guided tour of the location to invisible tourists.",
"Walk into a store and loudly whisper, ‘Do you have the secret item?’",
"Pretend to ‘sell’ something invisible to people passing by.",
"Start singing a nursery rhyme and see if anyone joins in.",
"Pretend to be a referee and blow an imaginary whistle.",
"Walk up to a stranger and tell them, ‘Congratulations! You’re the 100th person I’ve seen today!’",
"Ask someone if they’d like to join your ‘secret ninja training group.’",
"Pretend to do a photoshoot for an imaginary magazine in a public place.",
"Start marching like you’re in a parade and see if anyone joins.",
"Ask someone for advice on what name to give your imaginary pet goldfish.",
"Pretend you’re practicing for a Broadway musical audition and sing loudly.",
"Approach someone and ask if they’d like to join your ‘pirate crew.’",
"Stand on a bench or step and give a short ‘motivational speech’ to imaginary people.",
"Pretend you’re practicing for a comedy act and tell a random joke out loud.",
"Act like you’re searching for buried treasure with an invisible map.",
"Walk around holding an invisible baby and rock it to sleep.",
"Start practicing karate moves in the middle of a public park.",
"Pretend you’re an alien trying to blend in and ask people for help.",
"Pretend to be a statue in a public park for 2 minutes and see if anyone notices.",
"Walk up to someone and ask them for a hug, then say, 'Just kidding!'",
"Pretend to give a speech about an imaginary award you just won.",
"Walk around like you're on a fashion runway and pose dramatically every few steps.",
"Start talking to a tree as if it’s your old friend.",
"Pretend to ‘lose’ your shadow and start searching for it in public.",
"Walk up to a stranger and ask them if they believe in aliens, then nod seriously when they respond.",
"Sit down at a café table and pretend you’re on a very important business call.",
"Do a dramatic reading of a public sign or menu, as if it’s a piece of classic literature.",
"Start an impromptu yoga session in the middle of a busy area.",
"Ask a stranger to take a photo of you striking a superhero pose.",
"Walk up to a public trash can and loudly congratulate it for doing a great job.",
"Pretend to have a heated argument with your reflection in a store window.",
"Sit on a bench and slowly inch closer to someone until they move away or acknowledge you.",
"Ask a store employee for help finding something obviously visible right in front of you.",
"Walk backwards for 30 seconds in a public area.",
"Start spontaneously dancing in an elevator or while waiting in line.",
"Wear your jacket upside down (legs through sleeves) for 5 minutes while shopping.",
"Talk to a plant or tree in public as if it's an old friend you just ran into.",
"Pretend your phone is a walkie-talkie and speak into it using radio terminology.",
"Ask a stranger what year it is, then look shocked at their answer.",
"Stand in a busy area and take a 'selfie' with a banana or other fruit instead of a phone.",
"Walk up to a stranger and ask if they've seen your pet dinosaur.",
"Speak in a made-up foreign accent to the next person who talks to you.",
"Use hand puppets to order at a drive-thru or counter service restaurant.",
"Skip instead of walk for 2 minutes in a public place.",
"Hold the door open for someone who's still quite far away, making them hurry.",
"Loudly narrate what you're doing as you do it for 2 minutes in public.",
"Go to a bookstore and loudly gasp every time you open a book.",
"Pretend to conduct an invisible orchestra in a public place for 30 seconds.",
"Order a water at a restaurant and act like it's the most delicious thing you've ever tasted.",
"Wear sunglasses upside down for 10 minutes in public.",
"Pretend to trip and fall in slow motion in a public area.",
"Ask a store employee if they have any products that will protect you from aliens.",
"Ask a stranger to help you remember where you parked your helicopter.",
"Walk into a store and ask what city you're in, acting genuinely confused.",
"In a public place, act like you're a tour guide for 1 minute, describing obvious features.",
"Ask a stranger to settle a 'debate' about something silly.",
"Pretend your bag or purse is extremely heavy while walking through a store.",
"Walk up to a stranger and say, 'You look familiar. Weren't you in my dream last night?'",
"Loudly announce 'I've arrived!' when entering a public space.",
"Try to pay for something with Monopoly money (then use real money).",
"Walk into a store and ask if they sell time machines.",
"Take your shoes off and ask a store employee if they'd mind holding them for you.",
"Act surprised whenever you see your reflection for 10 minutes.",
"Ask a fast food employee if they can cut your sandwich into dinosaur shapes.",
"Speak to strangers only in rhymes for 5 minutes.",
"Wave enthusiastically at security cameras for one minute.",
"Start a conga line in a grocery store aisle and try to get people to join.",
"Ask a stranger to help you practice a very simple handshake.",
"Walk up to someone at a coffee shop and whisper, 'The eagle has landed,' then walk away.",
"Wear your clothes backwards in public for 10 minutes.",
"Ask someone to take a photo of you posing with a random object like it's a celebrity.",
"Tell a cashier that their scanner 'tickles' every time they scan your items.",
"Push an empty shopping cart around making car noises.",
"Pretend to slip on a banana peel in a public place (safely).",
"Ask a store employee to help you find the 'secret menu' items.",
"Talk to a mannequin in a store as if it's a real person for 30 seconds.",
"Walk up to a stranger and say, 'I think you dropped this,' and hand them a leaf or twig.",
"Walk very slowly through a crosswalk, acting like you're walking against strong wind.",
"Introduce yourself to a stranger with a made-up name and occupation.",
"Ask a store employee where they keep their invisible ink.",
"Pretend to have a conversation with a famous celebrity on your phone in public.",
"Order food using only sound effects to describe what you want.",
"Walk up to an empty chair and ask if it's taken, then have a conversation with it.",
"Try to 'sell' a random object to a friend using an infomercial voice in public.",
"Pretend your bottle of water is extremely hot when drinking it.",
"Ask a clothing store employee if they have clothes for your invisible friend.",
"Give a dramatic reading of a food wrapper's ingredients in public.",
"Ask a stranger to vote on which of two identical items looks better.",
"Sing 'Happy Birthday' to yourself in a public restroom.",
"Pretend to be an undercover spy in a store, speaking suspiciously into your sleeve.",
"Try to pay for something with a high-five.",
"Walk up to a public map and loudly exclaim, 'So THAT'S where I am!'",
"Stand next to a stranger and mimic their movements for 30 seconds.",
"Wear a paper bag as a hat for 10 minutes in public.",
"Ask a store employee to help you find something for your unicorn.",
"Pretend to be a robot while shopping for 3 minutes.",
"Go up to a stranger and tell them they've won 'Person of the Day' award.",
"Speak to a store employee using only movie quotes for an entire interaction.",
"Pretend to interview passersby for a fake documentary about sidewalks.",
"Ask a fast food employee if they can draw your portrait on the wrapper.",
"Try to start a wave in a waiting area or line.",
"Pretend you're a mime trapped in an invisible box while waiting in line.",
"Buy a single grape at a grocery store (then buy something real).",
"Walk around with a 'Free High-Fives' sign for 5 minutes.",
"Approach a stranger and ask them if they know the 'secret handshake'.",
"Pretend to be a fashion critic and comment on people's outfits (only compliments!).",
"Ask a bookstore employee where they keep books about mythical creatures, very seriously.",
"Wave at cars passing by for 3 minutes.",
"Ask to test drive a shopping cart before using it.",
"Pretend to be a food critic while eating something ordinary in public.",
"Hold a door open and bow dramatically as people enter.",
"Pretend to struggle opening a door that says 'push' by pulling it repeatedly.",
"Ask a store employee where the exit to Narnia is located.",
"Pretend to put on an invisible hat every time you enter a new store.",
"Carry a banana like it's a phone and pretend to talk on it in public.",
"Ask a stranger to guard your spot in line while you go 'fight crime'.",
"Pretend to be on a safari tour in a department store.",
"Try to return something you clearly just picked up in the store.",
"Ask a store employee if their products are dragon-proof.",
"Gallop instead of walk for 1 minute in a public place.",
"Order a glass of water at a restaurant with very specific instructions.",
"Act like you've never seen automatic doors before when entering a building.",
"Go to a pet store and talk to the animals in baby talk for 2 minutes.",
"Pretend your shadow is following you and try to escape from it.",
"Ask a stranger for directions to an imaginary place.",
"Pretend to be a sports commentator narrating people walking by.",
"Try to pay with foreign currency (before using real money).",
"Ask a cashier if they accept payment in high-fives or compliments.",
"Pretend you're in zero gravity while walking through a store.",
"Walk with exaggerated sneaky steps through a public place.",
"Talk to your food before eating it in a restaurant.",
"Pretend to be a secret shopper who's really bad at being secret.",
"Try to start a gentle group sing-along in an elevator.",
"Attempt to use a store's intercom system to find your 'lost pet rock'.",
"Ask a store employee if they know what day of the week it is, then act shocked at the answer.",
"Walk around a store with a 'bodyguard' friend who takes their role very seriously.",
"Introduce yourself to 3 strangers with a different name and backstory each time.",
"Pretend to be a time traveler confused by modern technology.",
"Wear your sunglasses on the back of your head and talk to people 'behind' you.",
"Speak in a newscaster voice for an entire shopping trip.",
"Ask a store employee to help you find your lost confidence.",
"Pretend to be a tourist in your own town, taking photos of mundane objects.",
"Try to start the wave in a quiet waiting room.",
"Ask a cashier if they can scan your forehead to check the price.",
"Walk through a clothing store pretending to be on a catwalk.",
"Wear mittens or gloves and struggle dramatically with simple tasks.",
"Go into a pharmacy and ask for medicine for your 'dragon hiccups'.",
"Pretend to slip while holding an empty cup, then act relieved nothing spilled.",
"Ask a stranger to tie your shoe for you (if wearing lace-up shoes).",
"Ask a store employee where they keep their anti-gravity boots.",
"Borrow a stranger's phone and take a selfie before giving it back.",
"Ask a fast food employee which menu item makes you run the fastest.",
"Pretend to be on a reality TV show while shopping.",
"Try to sell a random object to a stranger using an infomercial voice.",
"Walk into a store and loudly announce, 'I'm just browsing' every few minutes.",
"Give an acceptance speech after completing a simple purchase.",
"Try to use a banana as a phone in public.",
"Speak with dramatic pauses between each word for an entire interaction.",
"Ask three people in a row if they've seen your invisible dog.",
"Pretend to struggle with an 'extremely heavy' empty bag.",
"Walk up to a stranger and challenge them to a thumb war.",
"Ask a store employee which aisle has the unicorn food.",
"Go to a coffee shop and order in a made-up drink size.",
"Speak to strangers using only questions for 5 minutes.",
"Ask a store employee if they have a product that helps with werewolf transformations.",
"Attempt to start a flash mob by dancing alone in a public place.",
"Order food at a drive-thru using a different accent for each item.",
"Ask to test the softness of a stranger's sweater (with permission).",
"Pretend to be a royal with a made-up title when introducing yourself.",
"Act surprised and delighted every time you see your reflection.",
"Go into a store and ask if they sell time machines, looking disappointed when they say no.",
"Pretend to be a character from a video game collecting coins in a store.",
"Ask a store employee where the dinosaur section is, looking very serious.",
"Walk up to someone and say, 'You look just like my next friend!'",
"Pretend to be undercover and speak into your wrist while shopping."
  ]
  