[
    "Wave enthusiastically at strangers and see who waves back.",
    "Ask someone for directions to a completely made-up place.",
    "Sing a random song out loud while walking down the street.",
    "Pretend to be a statue for 30 seconds in a busy area.",
    "Stand in a line, even if there’s no reason for it, and see if others join.",
    "Walk backward for 10 steps and act like it’s normal.",
    "Clap and cheer when someone exits a store.",
    "Ask someone nearby to take a picture of you in a silly pose.",
    "Give a stranger a high five and say, ‘Great job today!’",
    "Pretend you’re a tour guide and explain landmarks to imaginary tourists.",
    "Do your best slow-motion run across a crosswalk.",
    "Walk up to a vending machine and dramatically argue with it like it’s a person.",
    "Hold an invisible microphone and interview someone about their ‘celebrity life.’",
    "Dance for 10 seconds in the middle of a sidewalk.",
    "Pretend to ‘catch’ an invisible ball someone else ‘throws’ to you.",
    "Start singing a Disney song and see if anyone joins in.",
    "Ask someone if they’ve seen your imaginary lost pet and describe it in detail.",
    "Walk up to a tree and thank it for its service to the planet.",
    "Ask someone if they know where the nearest unicorn rental is.",
    "Pretend to sneeze loudly and say, ‘Wow, that’s the third time today I sneezed glitter!’",
    "Walk around a store like you’re on a scavenger hunt for the silliest item.",
    "Start a slow clap in a public area and see if others join.",
    "Ask someone for their autograph and act like you’re starstruck.",
    "Pretend to be looking for Wi-Fi and walk around holding your phone in random places.",
    "Walk up to a stranger and compliment them on something random like their shoelaces.",
    "Stand at a crosswalk and dramatically pretend to direct traffic.",
    "Spin in a circle three times and then act dizzy while walking.",
    "Walk through a park like you’re in a dramatic movie scene.",
    "Start a fake phone conversation and say, ‘I can’t believe you bought a kangaroo!’",
    "Pretend to get stuck in an invisible box and ask someone for help getting out.",
    "Randomly point to the sky and look shocked—see if others look too.",
    "Act like you’re filming a cooking show and explain how to cook air.",
    "Ask a stranger if they’ve heard the good news and then tell them, ‘Tacos exist.’",
    "Pretend to be looking for a hidden treasure and ask people if they’ve seen it.",
    "Walk through a public area pretending to be on an important video call.",
    "Dance across a crosswalk like it’s your personal stage.",
    "Pretend you’re reporting live on breaking news and narrate what’s happening around you.",
    "Walk into a store and ask if they sell invisible pens.",
    "Pretend to take a selfie with someone random and thank them for being in your photo.",
    "Act like you’re hosting a fitness class and lead an exercise routine in public.",
    "Walk through a public area pretending to talk to an imaginary friend.",
    "Wave at cars driving by like you’re in a parade.",
    "Walk into a store and ask for directions to the moon.",
    "Act like you’re stuck in slow motion while walking through a busy area.",
    "Pretend you’re a traffic cone and stand still near a busy area.",
    "Carry an imaginary heavy box and ask someone for help holding it.",
    "Ask someone if they’ve ever been on TV and act impressed no matter what they say.",
    "Point to an object and loudly declare, ‘This is EXACTLY what I’ve been looking for!’",
    "Start clapping randomly in public and see if others join in.",
    "Pretend to be a detective investigating a mysterious bench or statue.",
    "Pretend to answer an invisible phone call and have a very animated conversation.",
    "Walk around looking for ‘the floor is lava’ safe spots.",
    "Approach someone and ask them what year it is, then act shocked at their answer.",
    "Pretend you’re measuring the sidewalk with invisible tools.",
    "Challenge a stranger to a rock-paper-scissors game.",
    "Walk up to someone and ask if they’ve seen your ‘time-traveling companion.’",
    "Sit on a park bench and narrate people’s actions like a nature documentary.",
    "Start a fake weather report about the area you’re in.",
    "Pretend you’re a robot and walk stiffly through a public area.",
    "Ask someone to ‘autograph’ your hand and act very excited.",
    "Pretend to get stuck in an invisible spider web and ask for help getting free.",
    "Walk into a public space and loudly announce, ‘I have arrived!’",
    "Pretend you’re searching for a secret door in a wall.",
    "Ask a stranger if they’ve heard the new hit single and hum an imaginary tune.",
    "Stand near a fountain and pretend to ‘fish’ with an invisible fishing pole.",
    "Walk into a store and ask if they sell dragon food.",
    "Pretend to practice your catwalk modeling skills on the sidewalk.",
    "Walk up to someone and ask, ‘If you were a superhero, what would your power be?’",
    "Ask someone if they know where to find the nearest unicorn.",
    "Pretend to be a mime stuck in an invisible elevator.",
    "Balance an imaginary book on your head and walk gracefully through a busy area.",
    "Pretend you’re giving a guided tour of the location to invisible tourists.",
    "Walk into a store and loudly whisper, ‘Do you have the secret item?’",
    "Pretend to ‘sell’ something invisible to people passing by.",
    "Start singing a nursery rhyme and see if anyone joins in.",
    "Pretend to be a referee and blow an imaginary whistle.",
    "Walk up to a stranger and tell them, ‘Congratulations! You’re the 100th person I’ve seen today!’",
    "Ask someone if they’d like to join your ‘secret ninja training group.’",
    "Pretend to do a photoshoot for an imaginary magazine in a public place.",
    "Start marching like you’re in a parade and see if anyone joins.",
    "Ask someone for advice on what name to give your imaginary pet goldfish.",
    "Pretend you’re practicing for a Broadway musical audition and sing loudly.",
    "Approach someone and ask if they’d like to join your ‘pirate crew.’",
    "Stand on a bench or step and give a short ‘motivational speech’ to imaginary people.",
    "Pretend you’re practicing for a comedy act and tell a random joke out loud.",
    "Act like you’re searching for buried treasure with an invisible map.",
    "Walk around holding an invisible baby and rock it to sleep.",
    "Start practicing karate moves in the middle of a public park.",
    "Pretend you’re an alien trying to blend in and ask people for help.",
    "Pretend to be a statue in a public park for 2 minutes and see if anyone notices.",
    "Walk up to someone and ask them for a hug, then say, 'Just kidding!'",
    "Pretend to give a speech about an imaginary award you just won.",
    "Walk around like you're on a fashion runway and pose dramatically every few steps.",
    "Start talking to a tree as if it’s your old friend.",
    "Pretend to ‘lose’ your shadow and start searching for it in public.",
    "Walk up to a stranger and ask them if they believe in aliens, then nod seriously when they respond.",
    "Sit down at a café table and pretend you’re on a very important business call.",
    "Do a dramatic reading of a public sign or menu, as if it’s a piece of classic literature.",
    "Start an impromptu yoga session in the middle of a busy area."
  ]
  