[
"Truth! who in the group would you sleep with? Let them know!",
"Exchange shirts for the rest of the game with a random player",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Do your sexiest dance",
"Leave a flirty note for someone",
"Kiss someone on the cheek",
"Confess a fantasy",
"Take an attractive selfie and share it",
"Seductively eat a piece of fruit",
"Give a body shot (if appropriate and consensual)",
"Whisper something dirty in someone's ear",
"Do a striptease (keep it PG-13 if needed)",
"Send a flirty text to your crush",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Play the next 3 turns without wearing any pants",
"Pick a player, and tell them to Shut the fuck up",
"Remove a piece of clothing from another player without using your hands.",
"Lick the earlobes of all the players of the opposite sex.",
"Bite the tip of the tongue from the player in front of you.",
"The player on your right gets to touch your bum for 30 seconds.",
"Go to another room, take a sexy picture and send it to one of your co-players.",
"Take a body shot, you may choose the person.",
"Lick the tip of the tongue of the player in front of you.",
"French kiss the player sitting in front of you.",
"Kiss the player on your right on the mouth.",
"Give the player to you right a body-to-body massage (30 sec).",
"Pretend to have the worst sex ever with the player on your left.",
"Lick the neck of all the players of the opposite sex.",
"Kiss the player in front of you on the mouth",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Take a pen and paper and draw your penis/vagina.",
"Give the group your naughtiest look.",
"Massage the legs of the player on your left.",
"Look into the eyes of the player on your left and tell him/her: You make me horny/sick/sleepy.",
"Sit on the lap of the player on your right for one round.",
"Fake an orgasm, while simulating a sexual position.",
"Perform a motorboat on somebody. If you are a girl let someone motorboat you.",
"Give another player of the same sex a big kiss on the mouth.",
"Take one of your co-players into another room and give him/her a sensual massage. (60sec.)",
"Attempt to seduce the player on your right.",
"Call a sex club and apply for a job. Stay on the phone for at least 1 minute.",
"Choose a female player and take off her bra using one hand.",
"Suck a finger of the player in front of you, of the opposite sex. (15sec.)",
"The player on your right has to spank you.",
"Give the player on your right a professional erotic massage.",
"Get blindfolded. All players have to kiss you and you have to guess who it is. Each wrong answer means a shot.",
"Facetime an old hookup. If they pick up, say something raunchy before hanging up.",
"Fake a blowjob on a bottle.",
"Perform a motorboat on someone. If you're a girl, have someone do it to you.",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Say a secret about someone in the room, but do not reveal their name.",
"Give someone in the group constructive criticism about their outfit.",
"Text a family member something about your sex life. They CAN'T be a sibling/cousin",
"Show the group your best 'Juno' position",
"Go to Cosmopolitan's website's love section and find a position you've never heard of. Then, try to act it out using whatever furniture and pillows you have at your disposal.",
"Change your Facebook status to 'I'm coming . . . I'm coming . . .'. Then, one minute later, change it to 'I just came.'",
"Someone gives you a back massage for one minute while you're blindfolded. If you like their style, you can choose to kiss them afterwards, but without knowing their identity.",
"Girls Only! Guys, look away. Compare nipple sizes. Smallest has to show the guys",
"true spicy… Take a shot of hot sauce, then kiss someone",
"Naked lap! If they group decides to let you… Underwear is acceptable",
"Close your eyes, sit on someone's lap and guess who it is.",
"Do a seductive dance for the group.",
"Search the dirtiest thing you can think of online and show it to the person beside you.",
"Let the group choose a song (no matter how slow/fast it is), and you have to dance like you work in a strip club, 2 articles have to be removed.",
"Whisper seducing words into the person on your lefts ear. If they pull away from feeling something, you win",
"Sit on the lap of the person to your left, bounce up and down, and moan 'Oh yeah'",
"Dedicate a romantic song to someone in the group and explain why you chose it for them.",
"Go in another room, and call someone playing the game. Act like you work at a sex phone line, and have a conversation.",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"To everyone playing, go around and say if you think they are 'shaven' or 'bushy'",
"Share a spicy photo with the group",
"Play one song you get off to.",
"Show the moves you would bust at the club if you were trying to seduce someone.",
"Read lyrics to 'Baby' by Justin Bieber to the group in your most seductive voice.",
"Call a relative. The group can ask one question.",
"Put 2 ice cubes down your pants and keep it there until it melts.",
"Act out your favorite sex position with a pillow.",
"Tell The Group an explicit fantasy of yours.",
"Do 5 push-ups, with someone laying with your heads aligned. (They will be laughing opposite)",
"Do a body shot off of someone's stomach. (Any Beverage)",
"Send a voice note to someone in front of the group describing what you want to do to them.",
"Swap shirts with someone in the group.",
"Lick someone's earlobe for 30 seconds",
"Make out with your hand for 30 seconds.",
"Suck on you're the person's finger 2 turns behind you for 15 seconds.",
"Take a picture of your butt and share it on social media. (Snapchat Counts)",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Attempt to twerk to 'WAP'",
"COYOTE UGLY, Sexy dance on the table or counter",
"Call your first boyfriend/girlfriend you can remember and say 'you wish it would've worked'",
"Play Spin The Bottle, you only get 2 re-spins",
"Share your search history with the person three turns in front of you",
"Remove a piece of clothing from another player without using your hands",
"Go in the other room, take a steamy photo, and send it to another player.",
"Give a thigh massage to 2 players, 30 seconds each",
"Pretend to be a sexy animal of the group's choosing.",
"Let someone suck YOUR finger, you win if they refuse",
"Let someone give you a hickey on your inner thigh, at least halfway above your knee",
"Tongue Play, Run it across someone's lips",
"Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
"Text another players family member, saying how hot they are.",
"Make eye contact with someone for 30 seconds without breaking or laughing.",
"Describe your perfect romantic evening in detail to the group.",
"Send a flirty text to the last person in your contacts you messaged.",
"Give someone a shoulder massage for one minute.",
"Tell the group about your first kiss experience.",
"Do your best impression of someone being seductive.",
"Use a piece of fruit to demonstrate your best flirting technique.",
"Show the group your best 'bedroom eyes' look.",
"Make up a short, flirty poem on the spot about someone in the room.",
"Describe your ideal date night with someone in the room (without naming them).",
"Show off your most attractive dance move.",
"Rank three people in the room from most to least attractive and explain why.",
"Let someone draw a temporary tattoo somewhere on your body of their choosing (appropriate areas only).",
"Tell the group your most embarrassing romantic encounter.",
"Create a seductive advertisement for an ordinary household object.",
"Demonstrate your best kissing technique on the back of your hand.",
"Share a romantic fantasy you've had (keep it PG-13).",
"Let the group pose you in a 'magazine cover' pose.",
"Write a short love note to someone in the room and read it aloud.",
"Do your best flirty walk across the room.",
"Describe your most attractive feature and why you think so.",
"Let someone feed you something with their hands.",
"Share what you think is most attractive about each person in the room.",
"Do your best impression of a cologne/perfume commercial.",
"Tell the group what celebrity you find most attractive and why.",
"Demonstrate what you think your 'signature move' would be.",
"Share your best pick-up line with the group.",
"Let the group collectively give you a new hairstyle.",
"Pretend you're on a first date with the person across from you for 1 minute.",
"Show everyone your best 'blue steel' or model face.",
"Rate everyone's smile in the room on a scale of 1-10.",
"Whisper a secret in someone's ear that makes them blush.",
"Create a short interpretive dance about attraction.",
"Share what you think is your best physical feature.",
"Let someone apply lipstick or chapstick to your lips.",
"Tell the group about a time you were completely infatuated with someone.",
"Do your best impression of a rom-com protagonist in a climactic scene.",
"Share what you find most attractive in a potential partner.",
"Create and demonstrate a signature cocktail/drink named after yourself.",
"Tell everyone your ideal romantic getaway destination and why.",
"Let someone pose you in three different 'model' poses.",
"Share a skill or talent you have that few people know about.",
"Give your best 'smoldering' look to each person in the room.",
"Describe your perfect date with someone in the group without revealing who.",
"Create a flirty persona and stay in character for three turns.",
"Show the group your most flattering selfie angle.",
"Tell everyone what song makes you feel most attractive.",
"Let someone feed you a bite of food in the most dramatic way possible.",
"Share what outfit makes you feel most confident and attractive.",
"Give someone a compliment that will make them blush.",
"Do your best impression of someone trying to flirt at a bar.",
"Tell everyone your favorite romantic movie scene and why it appeals to you.",
"Let the group vote on your most attractive feature.",
"Create a dating profile for yourself in just three sentences.",
"Share something you've always wanted to try but haven't had the courage to do yet.",
"Give a 30-second 'acceptance speech' for winning 'Most Attractive Person' award.",
"Tell the group about a time someone made you feel incredibly special.",
"Show everyone your signature dance move.",
"Share what you think is most attractive about the person to your right.",
"Give someone a hand massage for 30 seconds.",
"Tell everyone what fictional character you find most attractive and why.",
"Create a superhero whose power is based on attraction or seduction.",
"Share what scent or smell you find most attractive on others.",
"Let someone style your hair in the way they think looks best on you.",
"Tell the group about a time you tried to impress someone and it went wrong.",
"Demonstrate what you think is your most attractive facial expression.",
"Share what personality trait you find most attractive in others.",
"Let the group decide on a new nickname for you based on your best quality.",
"Tell everyone about the most romantic thing someone has done for you.",
"Do a seductive reading of a random paragraph from the nearest book or magazine.",
"Share what you'd change about your appearance if you could change one thing.",
"Give a brief tutorial on how to flirt effectively.",
"Tell everyone about your ideal romantic surprise.",
"Let someone draw a heart somewhere on your body (appropriate areas only).",
"Share what you think your best 'date night' quality is.",
"Do an impression of what you think you look like when you're flirting.",
"Tell the group about your biggest romantic 'deal-breaker'.",
"Let the person to your left whisper something in your ear that might make you blush.",
"Share what you think is the most romantic song ever and why.",
"Demonstrate your idea of the perfect slow dance position.",
"Tell everyone what you think is the most romantic city in the world and why.",
"Let someone apply a temporary tattoo or drawing somewhere visible on your body.",
"Share what you think is the most romantic gesture someone can make.",
"Do your best 'flirtatious laugh' for the group.",
"Tell everyone about a time you were completely smitten with someone.",
"Let the group decide what your 'signature scent' should be.",
"Share what clothing item you think looks most attractive on you.",
"Demonstrate what you think your 'camera-ready' pose would be.",
"Tell the group about your favorite romantic comedy and why you enjoy it.",
"Let someone feed you a drink (non-alcoholic options available).",
"Share what you think makes someone instantly more attractive.",
"Do your best impression of someone trying to subtly check someone out.",
"Tell everyone what talent or skill you find most attractive in others.",
"Create a brief romantic storyline involving two people in the room.",
"Share what you think is the most romantic time of year and why.",
"Let someone apply an ice cube to your wrist or neck for 5 seconds.",
"Tell the group what you find most appealing about your own personality.",
"Demonstrate your most charming smile.",
"Share what type of date makes you feel most comfortable.",
"Let the group decide what celebrity you most resemble.",
"Tell everyone what romantic gesture you'd most like to receive.",
"Do your best sultry voice saying a random phrase chosen by the group.",
"Share what fashion style you find most attractive on others.",
"Let someone trace a word or shape on your back for you to guess.",
"Tell the group about the most embarrassing thing you've done to impress someone.",
"Demonstrate what you think your 'signature walk' looks like.",
"Share what time of day you feel most attractive or confident.",
"Let the person to your right whisper a dare in your ear that you must complete.",
"Tell everyone what movie scene you find most romantic.",
"Do an impression of what you think you look like when you get ready for a date.",
"Share one bold or adventurous thing you'd like to try someday.",
"Let someone pose with you for a 'prom photo' style picture.",
"Tell the group what you think is the perfect romantic dinner.",
"Create a fictional 'how we met' story with someone in the room.",
"Share what song you would choose for your first dance at a wedding.",
"Let the group decide what your dating show tagline would be.",
"Tell everyone about a time you were completely caught off guard by attraction.",
"Demonstrate what you think your 'thinking face' looks like.",
"Share what you find most mysterious or intriguing about the opposite gender.",
"Let someone choose your profile picture for a dating app from your photo library.",
"Tell the group what you think is the most romantic line from a movie.",
"Do your best impression of a fashion model on a runway.",
"Share what you think is the most attractive personality trait you possess.",
"Let the person across from you ask you three questions you must answer truthfully.",
"Tell everyone what fictional couple you think has the best chemistry.",
"Demonstrate your most charming personality trait in an exaggerated way.",
"Share what you think is the most attractive way someone can laugh.",
"Let someone feed you something sweet while you're blindfolded.",
"Tell the group about a time you were completely speechless around someone attractive.",
"Do your best 'awkward flirting' impression.",
"Share what you find most attractive about someone's eyes.",
"Let everyone anonymously write down a compliment for you, then read them aloud.",
"Tell the group what you think is the most romantic setting or environment.",
"Create a brief 'missed connections' ad about someone in the room.",
"Share what type of compliment means the most to you.",
"Let someone teach you a flirty dance move.",
"Tell everyone what you think makes someone a good kisser (in theory).",
"Demonstrate what you think is your most attractive profile angle.",
"Share what type of date you would plan to impress someone special.",
"Let the group vote on what reality dating show you would be most suited for.",
"Tell everyone what you think is the most romantic season and why.",
"Create and demonstrate a secret handshake with romantic undertones.",
"Share what you think your dating profile headline should be.",
"Demonstrate what you consider your most seductive move.",
"Describe your perfect fantasy evening without holding back.",
"Show the group how you'd seduce someone using only your eyes and facial expressions.",
"Whisper your wildest fantasy to the person on your right.",
"Act out how you think you look in your most intimate moments.",
"Reveal three places on your body that drive you wild when touched.",
"Demonstrate your ideal kissing technique on a piece of fruit.",
"Share a detailed account of your most thrilling romantic encounter.",
"Show everyone the face you make when you're extremely pleased.",
"Act out what you imagine your 'signature move' to be.",
"Describe in vivid detail what turns you on the most.",
"Demonstrate what you think you look like during your most passionate moments.",
"Share your most adventurous fantasy location and what would happen there.",
"Use your hands to show the group your most sensual massage technique.",
"Describe what you think your best physical attribute is and why it drives others wild.",
"Demonstrate how you'd approach someone you're intensely attracted to.",
"Share your secret technique for driving someone crazy with desire.",
"Act out what you think your 'O' face looks like.",
"Describe your ideal romantic partner and what they would do to please you.",
"Show the group how you'd remove an article of clothing seductively.",
"Share a detailed fantasy involving someone in the room (without naming them).",
"Demonstrate your most enticing dance move.",
"Describe the most intimate place on your body and why you enjoy it being touched there.",
"Show everyone how you'd tease someone you're attracted to.",
"Share what sound you make when you're extremely satisfied.",
"Demonstrate your best bedroom eyes while biting your lip.",
"Describe in detail what your perfect intimate scenario would involve.",
"Show the group what facial expression you make when you're turned on.",
"Share the most adventurous place you'd be willing to get intimate.",
"Act out how you'd respond if someone hit your secret pleasure spot.",
"Describe your most sensitive area and how you like it to be touched.",
"Demonstrate how you'd kiss someone if you were trying to drive them wild.",
"Share what fantasy you've always wanted to try but haven't yet.",
"Show everyone your best seductive walk across the room.",
"Describe what you imagine your 'finish line' face looks like.",
"Act out how you'd respond to someone whispering something extremely naughty in your ear.",
"Share what clothing item you find most appealing on a potential partner and why it turns you on.",
"Demonstrate how you think you look when you're in a state of ecstasy.",
"Describe your ideal foreplay scenario in detail.",
"Show the group what you imagine your 'getting in the mood' face looks like.",
"Share what unexpected thing someone could do that would instantly turn you on.",
"Act out how you'd respond if someone kissed your most sensitive spot.",
"Describe your favorite position without using the actual name for it.",
"Demonstrate how you'd entice someone using just your hands.",
"Share the most unusual place you'd be willing to get intimate.",
"Show everyone what you think you look like in the heat of passion.",
"Describe what you imagine your 'special skills' to be.",
"Act out how you'd handle being completely overwhelmed with pleasure.",
"Share what you'd whisper to someone to instantly turn them on.",
"Demonstrate your idea of the perfect lap dance (keep clothing on).",
"Describe what fantasy scenario you'd create if you had a room to yourself and a partner.",
"Show the group how you'd respond to someone hitting all the right spots.",
"Share what unexpected thing you've discovered about your own desires.",
"Act out how you'd seduce someone using only body language.",
"Describe what you think your most impressive bedroom skill is.",
"Demonstrate what you imagine your 'peak moment' expression to be.",
"Share how you'd describe your intimate style in three words and explain why.",
"Show everyone how you'd respond to an unexpected pleasure.",
"Describe the most sensitive area on your body that isn't commonly mentioned.",
"Act out how you'd respond to someone discovering your secret turn-on.",
"Share what fantasy role you'd most want to play and why it appeals to you.",
"Demonstrate how you'd use ice in a seductive way.",
"Describe what you think makes you uniquely skilled in intimate situations.",
"Show the group how you'd handle being completely overcome with sensation.",
"Share what unconventional item you'd incorporate into a passionate encounter.",
"Act out how you'd tease someone to the point of begging.",
"Describe your ideal role-play scenario without holding back.",
"Demonstrate what you think your 'completely satisfied' expression looks like.",
"Share what unexpected talent you have that translates well to intimate situations.",
"Show everyone how you'd use just your voice to seduce someone.",
"Describe what wild scenario you'd try if no one would ever know about it.",
"Act out how you'd respond to discovering a new pleasure you never knew existed.",
"Share what you think your most enticing physical feature is during intimate moments.",
"Demonstrate how you'd approach someone with pure desire.",
"Describe what you think your 'signature sound' is in passionate moments.",
"Show the group how you'd handle reaching the point of no return.",
"Share what fantasy setting most appeals to you and why it would be thrilling.",
"Act out how you'd respond to someone pushing all your buttons at once.",
"Describe the most adventurous thing you'd be willing to try with the right partner.",
"Demonstrate what you think you look like when completely lost in the moment.",
"Share what you believe your most irresistible quality is when things get heated.",
"Show everyone how you'd communicate what you want without using words.",
"Describe what you imagine your most skilled technique to be.",
"Act out how you'd respond to the most intense pleasure you can imagine.",
"Share what fantasy you think about most often.",
"Demonstrate how you'd use just your fingertips to drive someone wild.",
"Describe what unique approach you bring to intimate encounters.",
"Show the group what you think your 'absolutely can't take anymore' face looks like.",
"Share what unexpected thing you've discovered turns you on immensely.",
"Act out how you'd handle being pleasantly surprised by a new sensation.",
"Describe your ideal scenario if you could be completely uninhibited.",
"Demonstrate what you imagine your most seductive move to be.",
"Share what fantasy element you'd introduce to spice things up with a partner.",
"Show everyone how you'd handle reaching your absolute limit of pleasure.",
"Describe what you think makes your approach to intimacy unique.",
"Act out how you'd respond to something so good it leaves you speechless.",
"Share what unexpected place on your body is surprisingly sensitive.",
"Demonstrate how you'd use your entire body to entice someone.",
"Describe what you think your most impressive 'move' would be.",
"Show the group what you imagine your face looks like at the moment of ultimate pleasure.",
"Share what fantasy scenario you've thought about but never shared with anyone.",
"Act out how you'd respond to discovering a new favorite sensation.",
"Describe what you believe would drive a partner absolutely wild.",
"Demonstrate how you'd approach someone if you were feeling completely uninhibited.",
"Share what unexpected skill you have that would translate well to intimate situations.",
"Show everyone how you'd handle being completely overcome with desire.",
"Describe what you think makes your intimate style memorable.",
"Act out how you'd respond to the most intense moment you can imagine.",
"Share what fantasy element you've always wanted to explore.",
"Demonstrate what you think your 'completely undone' expression looks like.",
"Describe what technique you believe you've mastered.",
"Show the group how you'd handle being brought to the edge repeatedly.",
"Share what unexpected thing you've discovered about your own pleasure.",
"Act out how you'd respond to something so good it makes you lose control.",
"Describe what fantasy setting most inspires your imagination.",
"Demonstrate how you'd use your voice to express extreme satisfaction.",
"Share what you believe your most attractive quality is in intimate moments.",
"Show everyone how you'd handle reaching a point of complete surrender.",
"Describe what unique approach you bring to pleasuring someone else.",
"Act out how you'd respond to discovering your ultimate weakness.",
"Share what fantasy scenario plays in your mind during private moments.",
"Demonstrate what you think your most enticing expression would be.",
"Describe what you believe would be impossible for someone to resist about you.",
"Show the group how you'd handle the moment just before reaching your peak.",
"Share what unexpected discovery you've made about what drives you wild.",
"Act out how you'd respond to experiencing your ultimate fantasy.",
"Describe what you imagine your most impressive skill to be.",
"Demonstrate how you'd use just your breath to drive someone crazy.",
"Share what fantasy role you'd most want to embody and why.",
"Show everyone what you think you look like when completely letting go.",
"Describe what technique you believe you could teach a masterclass on.",
"Act out how you'd respond to someone finding your secret sensitive spot.",
"Share what unexpected scenario you find surprisingly arousing.",
"Demonstrate how you'd communicate exactly what you want without words.",
"Describe what you believe makes your approach to pleasure unique.",
"Show the group what you imagine your 'completely satisfied' expression to be.",
"Share what fantasy you'd fulfill if you had one consequence-free opportunity.",
"Act out how you'd seduce someone using just eye contact and subtle movements.",
"Describe what you think makes you uniquely skilled in giving pleasure.",
"Demonstrate what you imagine your most irresistible invitation would look like.",
"Share what unexpected thing you've learned about giving someone else pleasure.",
"Show everyone how you'd handle being caught in a moment of complete ecstasy.",
"Describe what fantasy scenario would fulfill your wildest dreams.",
"Act out how you'd respond to discovering a new favorite way to be touched.",
"Give a seductive dance performance for 30 seconds.",
"Remove an article of clothing and play the next three rounds without it.",
"Demonstrate your most seductive facial expression to everyone in the room.",
"Use an ice cube to trace a path on your neck and collarbone.",
"Give a lap dance to the person of your choice for 20 seconds (clothing stays on).",
"Let someone feed you something sweet in the most suggestive way possible.",
"Act out your most passionate kiss with a pillow or stuffed animal.",
"Whisper something suggestive in three different people's ears.",
"Do your sexiest walk across the room while maintaining eye contact with someone.",
"Take a body shot off the person of your choice (if alcohol is being consumed, otherwise use a non-alcoholic beverage).",
"Role-play meeting a stranger at a bar and trying to get their number.",
"Let someone trace an ice cube on your arm for 15 seconds with your eyes closed.",
"Do your best impression of a perfume/cologne commercial - make it as seductive as possible.",
"Take a suggestive selfie and show it to the group (you decide how suggestive).",
"Perform a strip tease but only remove one item (like a jacket, shoe, or accessory).",
"Let two people apply lipstick or lip gloss to your lips without using their hands.",
"Feed someone a piece of fruit or dessert in the most seductive way you can.",
"Give someone a back massage for 30 seconds while others rate your technique.",
"Demonstrate what you think your 'signature move' would be using a chair.",
"Let someone trace their finger along your arm while you close your eyes.",
"Act out how you'd respond to someone whispering in your ear (exaggerate your reaction).",
"Let the group pose you in what they think is your most flattering position.",
"Pick someone to give a sensual hand or foot massage to for 30 seconds.",
"Perform your interpretation of a seductive scene from a movie.",
"Let someone feed you a drink without using your hands.",
"Do your best impression of a model posing for a 'tastefully sexy' photoshoot.",
"Sit on someone's lap and whisper something in their ear that makes them blush.",
"Act out your reaction to receiving the best kiss of your life.",
"Let three people take turns applying a temporary tattoo or drawing somewhere visible on your body.",
"Do a dramatic reading of song lyrics in your most seductive voice.",
"Perform a seductive dance move while maintaining eye contact with someone.",
"Let someone trace words on your back and guess what they wrote (eyes closed).",
"Give someone your best bedroom eyes while slowly eating something sweet.",
"Let two people position you in what they consider a 'model pose'.",
"Apply lip gloss/chapstick in the most dramatic way possible.",
"Choose someone to have a fake 'heated moment' with (just acting, no actual contact).",
"Demonstrate three different types of kissing styles using the back of your hand.",
"Let someone draw a heart somewhere on your body (appropriate areas only).",
"Perform your best sexy dance move using a chair as a prop.",
"Let someone whisper something in your ear, and you must act out your genuine reaction.",
"Strike three poses that show off what you consider your best physical features.",
"Feed someone else something sweet while maintaining constant eye contact.",
"Let someone apply a mild hot sauce or spicy food to your lips and then lick it off.",
"Act out how you'd respond to someone giving you the perfect compliment.",
"Choose someone to slow dance with closely for 30 seconds.",
"Write a flirty message on someone's arm or hand with your finger.",
"Do your best impression of someone having a 'moment of pleasure' from eating something delicious.",
"Let someone trace their fingers through your hair for 15 seconds.",
"Perform a mock striptease but stop after removing just one item (like a jacket).",
"Let two people position you like a mannequin in a 'romantic pose'.",
"Feed yourself something in the most seductive way possible while maintaining eye contact with someone.",
"Give someone a sensual shoulder massage for 30 seconds.",
"Practice your most seductive expressions in front of everyone for 20 seconds.",
"Let someone apply a blindfold and guess who's touching your hand or arm.",
"Demonstrate three different ways to remove a jacket or sweater, from least to most seductive.",
"Let someone trace the outline of your face with their finger (no touching, just tracing the air).",
"Act out how you'd respond to receiving an unexpected compliment about your appearance.",
"Choose someone to fake flirt with for 30 seconds using only body language.",
"Demonstrate how you'd seduce someone using only your eyes and facial expressions.",
"Let someone feed you something cold (like ice cream) while you react dramatically.",
"Perform your interpretation of the most sensual scene from a music video.",
"Let two people position your arms and legs in what they consider a 'magazine cover pose'.",
"Whisper something in a different person's ear until you make someone blush.",
"Take a selfie from your most flattering angle and show everyone.",
"Let someone apply a temporary tattoo somewhere visible that you wouldn't normally show.",
"Give three people your most flirtatious look and see who blushes first.",
"Demonstrate what you consider your most attractive walk.",
"Let someone give you a brief neck or shoulder massage while you react honestly.",
"Act out how you'd respond to receiving the world's best compliment.",
"Feed someone else with your eyes closed, guided only by their directions.",
"Perform your best impression of a runway model showing off an outfit.",
"Let someone apply an ice cube to your wrist and react naturally.",
"Give someone your best 'smoldering' look for 15 seconds without breaking.",
"Act out how you'd respond to someone finding your most sensitive (but appropriate) spot.",
"Let the group vote on and then help you create your 'signature pose'.",
"Demonstrate what you consider your most alluring dance move.",
"Let someone trace a path from your hand to your elbow with their finger.",
"Perform how you think you'd look during a slow-motion hair flip commercial.",
"Let two people position you in what they think would be your dating profile picture pose.",
"Give someone a compliment while maintaining intense eye contact.",
"Act out your reaction to someone whispering something scandalous in your ear.",
"Let someone apply a blindfold while you try to identify who's speaking to you.",
"Demonstrate three different ways to sit in a chair, from casual to seductive.",
"Let someone feed you something sweet while others rate your reaction.",
"Perform your best impression of a perfume/cologne advertisement's seductive pose.",
"Let someone draw something on your back and guess what it is by sensation.",
"Give your best impression of someone being completely captivated by someone else.",
"Act out your reaction to seeing someone extremely attractive enter the room.",
"Let two people pose with you in what they consider a 'romantic movie poster'.",
"Demonstrate how you'd apply lotion to your arms in the most dramatic way possible.",
"Let someone whisper three different compliments and visibly react to each one.",
"Give someone a 'sexy' makeover using imaginary makeup and narrate what you're doing.",
"Act out how you'd present yourself if you were the star of a romantic movie.",
"Let someone trace a heart on different parts of your arm or hand while you're blindfolded.",
"Perform what you think your 'signature move' would be if you were a professional dancer.",
"Let two people create a 'magazine worthy' pose for you.",
"Give your most dramatic reaction to tasting something incredibly delicious.",
"Act out how you'd respond to receiving increasingly flattering compliments.",
"Let someone guide your hand to draw something while you're blindfolded.",
"Demonstrate three different ways to bite your lip, from subtle to obvious.",
"Let someone pose with you in a 'prom photo' style embrace.",
"Give your best impression of someone being completely entranced by someone else.",
"Act out how you'd react if someone whispered your biggest fantasy in your ear.",
"Let the group collectively direct you in a 'romantic lead' pose.",
"Demonstrate how you'd eat something sweet if you were in a commercial.",
"Let someone trace letters on your palm while you guess what they're writing.",
"Give someone your most captivating look while they try not to react.",
"Act out how you'd respond to three increasingly flattering compliments.",
"Let someone apply a small amount of whipped cream or dessert topping to your finger, then remove it without using your other hand.",
"Demonstrate what you'd look like if you were in a shampoo commercial during the 'hair flip' moment.",
"Let the group direct you in three poses that show your 'best angles'.",
"Give your most theatrical reaction to someone whispering something shocking.",
"Act out how you'd respond if someone found your most ticklish spot.",
"Let someone trace their fingers near (not touching) your face as you react naturally.",
"Demonstrate three different ways to remove a jacket, with increasing dramatics.",
"Let someone feed you something while you're blindfolded and guess what it is.",
"Give your best impression of someone being completely smitten.",
"Act out how you'd respond to someone giving you the perfect compliment about your appearance.",
"Let two people direct you in what they consider your 'most photogenic pose'.",
"Demonstrate how you'd act if you were the romantic lead in a music video.",
"Let someone draw on your arm with their finger and guess what they're drawing.",
"Give your most exaggerated reaction to someone telling you you're attractive.",
"Act out how you'd respond to someone giving you a surprise compliment.",
"Let the group decide on and then create your 'perfect profile picture pose'.",
"Demonstrate what you'd look like in slow motion entering a room trying to catch someone's attention.",
"Let someone trace a path on your hand while you describe the sensation with your eyes closed.",
"Give your best impression of someone who just received a very forward compliment.",
"Act out how you'd respond to three increasingly surprising compliments.",
"Let two people position you in what they think is your most flattering angle.",
"Demonstrate how you'd react if someone unexpectedly kissed your hand.",
"Let someone whisper compliments while you try not to show any reaction.",
"Give your best impression of someone trying to play it cool while being very attracted to someone.",
"Act out your reaction to receiving increasingly flattering text messages.",
"Let someone direct you as if you were modeling for a 'tasteful but suggestive' photoshoot.",
"Demonstrate how you'd dramatically apply lip balm if you were trying to get someone's attention.",
"Let someone trace shapes on your palm while you guess with your eyes closed.",
"Give three different versions of your 'caught by surprise' expression, from subtle to dramatic.",
"Act out how you'd respond to someone finding your one ticklish spot that drives you wild.",
"Let two people position you like a mannequin in their idea of a 'movie star pose'.",
"Demonstrate three different ways to eat something sweet, from casual to seductive.",
"Let someone direct you through three facial expressions that show increasing attraction.",
"Give your most realistic reaction to someone saying something completely unexpected but flattering.",
"Act out how you'd respond to receiving a very forward but welcome compliment.",
"Let the group vote on and then help create your 'signature seductive look'."
]