[
  "Truth! who in the group would you sleep with? Let them know!",
  "Exchange shirts for the rest of the game with a random player",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "Do your sexiest dance",
  "Leave a flirty note for someone",
  "Kiss someone on the cheek",
  "Confess a fantasy",
  "Take an attractive selfie and share it",
  "Seductively eat a piece of fruit",
  "Give a body shot (if appropriate and consensual)",
  "Whisper something dirty in someone's ear",
  "Do a striptease (keep it PG-13 if needed)",
  "Send a flirty text to your crush",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "Play the next 3 turns without wearing any pants",
  "Pick a player, and tell them to Shut the fuck up",
  "Remove a piece of clothing from another player without using your hands.",
  "Lick the earlobes of all the players of the opposite sex.",
  "Bite the tip of the tongue from the player in front of you.",
  "The player on your right gets to touch your bum for 30 seconds.",
  "Go to another room, take a sexy picture and send it to one of your co-players.",
  "Take a body shot, you may choose the person.",
  "Lick the tip of the tongue of the player in front of you.",
  "French kiss the player sitting in front of you.",
  "Kiss the player on your right on the mouth.",
  "Give the player to you right a body-to-body massage (30 sec).",
  "Pretend to have the worst sex ever with the player on your left.",
  "Lick the neck of all the players of the opposite sex.",
  "Kiss the player in front of you on the mouth",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "Take a pen and paper and draw your penis/vagina.",
  "Give the group your naughtiest look.",
  "Massage the legs of the player on your left.",
  "Look into the eyes of the player on your left and tell him/her: You make me horny/sick/sleepy.",
  "Sit on the lap of the player on your right for one round.",
  "Fake an orgasm, while simulating a sexual position.",
  "Perform a motorboat on somebody. If you are a girl let someone motorboat you.",
  "Give another player of the same sex a big kiss on the mouth.",
  "Take one of your co-players into another room and give him/her a sensual massage. (60sec.)",
  "Attempt to seduce the player on your right.",
  "Call a sex club and apply for a job. Stay on the phone for at least 1 minute.",
  "Choose a female player and take off her bra using one hand.",
  "Suck a finger of the player in front of you, of the opposite sex. (15sec.)",
  "The player on your right has to spank you.",
  "Give the player on your right a professional erotic massage.",
  "Get blindfolded. All players have to kiss you and you have to guess who it is. Each wrong answer means a shot.",
  "Facetime an old hookup. If they pick up, say something raunchy before hanging up.",
  "Fake a blowjob on a bottle.",
  "Perform a motorboat on someone. If you're a girl, have someone do it to you.",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "Say a secret about someone in the room, but do not reveal their name.",
  "Give someone in the group constructive criticism about their outfit.",
  "Text a family member something about your sex life. They CAN'T be a sibling/cousin",
  "Show the group your best 'Juno' position",
  "Go to Cosmopolitan's website's love section and find a position you've never heard of. Then, try to act it out using whatever furniture and pillows you have at your disposal.",
  "Change your Facebook status to 'I'm coming . . . I'm coming . . .'. Then, one minute later, change it to 'I just came.'",
  "Someone gives you a back massage for one minute while you're blindfolded. If you like their style, you can choose to kiss them afterwards, but without knowing their identity.",
  "Girls Only! Guys, look away. Compare nipple sizes. Smallest has to show the guys",
  "true spicy… Take a shot of hot sauce, then kiss someone",
  "Naked lap! If they group decides to let you… Underwear is acceptable",
  "Close your eyes, sit on someone's lap and guess who it is.",
  "Do a seductive dance for the group.",
  "Search the dirtiest thing you can think of online and show it to the person beside you.",
  "Let the group choose a song (no matter how slow/fast it is), and you have to dance like you work in a strip club, 2 articles have to be removed.",
  "Whisper seducing words into the person on your lefts ear. If they pull away from feeling something, you win",
  "Sit on the lap of the person to your left, bounce up and down, and moan 'Oh yeah'",
  "Dedicate a romantic song to someone in the group and explain why you chose it for them.",
  "Go in another room, and call someone playing the game. Act like you work at a sex phone line, and have a conversation.",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "To everyone playing, go around and say if you think they are 'shaven' or 'bushy'",
  "Share a spicy photo with the group",
  "Play one song you get off to.",
  "Show the moves you would bust at the club if you were trying to seduce someone.",
  "Read lyrics to 'Baby' by Justin Bieber to the group in your most seductive voice.",
  "Call a relative. The group can ask one question.",
  "Put 2 ice cubes down your pants and keep it there until it melts.",
  "Act out your favorite sex position with a pillow.",
  "Tell The Group an explicit fantasy of yours.",
  "Do 5 push-ups, with someone laying with your heads aligned. (They will be laying opposite)",
  "Do a body shot off of someone's stomach. (Any Beverage)",
  "Send a voice note to someone in front of the group describing what you want to do to them.",
  "Swap shirts with someone in the group.",
  "Lick someone's earlobe for 30 seconds",
  "Make out with your hand for 30 seconds.",
  "Suck on person's finger 2 turns behind you for 15 seconds.",
  "Take a picture of your butt and share it on social media. (Snapchat Counts)",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag",
  "Attempt to twerk to 'WAP'",
  "COYOTE UGLY, Sexy dance on the table or counter",
  "Call your first boyfriend/girlfriend you can remember and say 'you wish it would've worked'",
  "Play Spin The Bottle, you only get 2 re-spins",
  "Share your search history with the person three turns in front of you",
  "Remove a piece of clothing from another player without using your hands",
  "Go in the other room, take a steamy photo, and send it to another player.",
  "Give a thigh massage to 2 players, 30 seconds each",
  "Pretend to be a sexy animal of the group's choosing.",
  "Let someone suck YOUR finger, you win if they refuse",
  "Let someone give you a hickey on your inner thigh, at least halfway above your knee",
  "Tongue Play, Run it across someone's lips",
  "Post a status or Story saying 'I Love the game TriviaDare!' and use #triviadare hashtag"
]