[
  "Roast every other player with one word.",
  "Make a straight face. Everyone playing tries to make you laugh! If you lose your face, you don't complete this challenge!",
  "Have a deep and meaningful conversation with a household object for three minutes.",
  "Do a dramatic reading of an instruction manual.",
  "Call the 17th person on your contact list, make a farting sound, and then hang up.",
  "Text a loved one and tell them you have joined a cult that worships Mighty Mouse. If they don't reply, you lose!",
  "Text your ex \"Happy Birthday\"",
  "Text your ex \"You were right\".",
  "Pick someone to give you 2 truths and a lie, if you can guess their lie, you complete this!",
  "If you're in public, sing the beginning of the national anthem at a moderate volume.",
  "Read the last page of a book you haven't finished yet",
  "Share your most scandalous hot take. If they group doesn't believe it's scandalous enough, you lose.",
  "Eat 3 spoonfuls of a condiment of the tables choice. (Nothing you're allergic to!)",
  "Let at least 2 people scroll through your instagram DM's",
  "Try and drink a glass of water without using your hands.",
  "Let another person post an instagram caption on your behalf",
  "Pick someone in this room & (hilariously) roast them for one minute straight.",
  "Hand over your phone to another player who can send a single text saying anything they want to anyone they want.",
  "Eat a packet or tablespoon of hot sauce.",
  "Go outside and try to \"summon\" the rain as loud as possible.",
  "Talk to your pillow as if it was your crush. End with a smooch.",
  "Post a photo (any photo) to social media with a heartfelt dedication to a celebrity of the group's choosing.",
  "Describe the most attractive quality of every person in the room.",
  "Post a flirty comment on the first instagram picture you see.",
  "Try and Juggle 3 things of the groups choice.",
  "Let someone tickle you, if you laugh, you lose.",
  "Update your facebook relationship status, if you get 10 reactions (includes comments) in 3 minutes, you lose",
  "Do an impression of a famous person. If No one guesses who it is, you lose.",
  "Let the players on both sides of you give you a wet willy at the same time.",
  "Do your best impression of a baby being born.",
  "Put 3 ice cubes in your underwear. If you make a face, you lose.",
  "Beg and please the person to your right not to leave you for that other boy or girl. Weeping and wailing is encouraged.",
  "Sell a piece of trash to someone in the group using your best sales tactic.",
  "Gargle something that should be gargled, but won't hurt you.",
  "Get slapped on the face by the person of your choosing. (As hard as they want)",
  "Get spanked by someone in the room of the groups choosing.",
  "Have each person guess the color of underwear you're wearing. If someone gets it right, you lose!",
  "Give everyone in the group a prolonged heartfelt hug. Only let go when they say it's getting uncomfortable.",
  "Welcome to my TED talk. Give a one-minute speech on a subject you know a lot about.",
  "HIDE AND SEEK! You have 15 seconds to hide. The group will hunt you down. If they must find you within a minute.",
  "Pretend to be a statue for 2 minutes. If you move, you lose.",
  "Balance a book on your head and walk across the room and back. If the book falls, you lose.",
  "Do your best animal impersonation. If no one can guess the animal, you lose.",
  "Find a stranger and get them to download TriviaDare! On the appstore. If they refuse, you lose.",
  "Do your best impersonation of a chicken. If no one laughs, you lose.",
  "Spin around 10 times and try to walk in a straight line. If you stumble, you lose.",
  "Call a pizza shop and ask if they have have used anchovies today. If they say yes, you lose!",
  "Whistle a song, if the players can't guess what it is, you lose!",
  "Kiss each person playing on the cheek, if someone refuses, you lose!",
  "Post a status/story saying \"I Love Playing TriviaDare! #TriviaDare\".",
  "Poorly describe a movie! If they can't guess what it is, you win. Has to somewhat make sense.",
  "Do an impression of an animal chosen by the group.",
  "Act out a stereotypical hallmark movie. If the group likes it, you win!",
  "Call a random contact and tell them you have to end it, but reassure them \"It's not you, it's me.\"",
  "Take off your socks with your teeth. If you can't, you lose!",
  "Give each player a piece of advice tailored specifically to them.",
  "Go into the bathroom alone and say \"Bloody Mary\" three times in the mirror with the lights off.",
  "Let the player to your left give you a wedgie.",
  "Take a shot of lemon juice, if you make a face, you lose!",
  "Drink 3 sips of a mystery brew concocted by the rest of the group. (Everything has to be edible)",
  "Ask the neighbors to borrow a cup of sugar. If they give you one, you win!",
  "Open Facebook and like the first post, whether you agree or not.",
  "Write a really long, really detailed Instagram post about the process of buying your last pair of shoes.",
  "Ask someone if they know Charlie The Unicorn, if they don't, you lose.",
  "Do a belly dance for the group.",
  "*Secretly* Have the person to your right give you a charade. If the rest of the group can figure it out, you win!",
  "Chug your drink of choice.",
  "Chug a carbonated beverage, if you burp, you lose.",
  "Post a status/story saying \"I Love Playing TriviaDare! #TriviaDare\".",
  "Random item! Ask the group a everyday item, if they have it immediately on their person/purse, you win. (No PHONES)",
  "Go outside and shout at the top of your lungs, \"I am [your name]! Hear me roar!\"",
  "Try to touch your nose with your tongue. If you can't, you lose!",
  "Call McDonald's and ask if they sell Whoppers.",
  "FaceTime someone and pick your nose during the conversation.",
  "Post a status/story saying \"I Love Playing TriviaDare! #TriviaDare\".",
  "Run around the house with a pair of underwear on your head.",
  "Go outside and do your best wolf howl at the moon.",
  "Call a random number and pretend to be a different personality.",
  "Do an interpretive dance of human life.",
  "Prank call a friend or family member.",
  "Go on Facebook/Instagram and like 25 photos of the first person you see.",
  "Lay on the floor and act like you are a piece of frying bacon.",
  "Re-enact the worst date you've ever been on.",
  "Wear dirty socks belonging to somebody else.",
  "Smell the breath of everyone in the room and rank them from best to worst.",
  "Text five people in your phone contacts list (Chosen by the group) with the message \"I'm the greatest person I know.\"",
  "Sniff another player's armpit and guess what deodorant they use. If you're right, you win the dare!",
  "Give yourself a marker mustache",
  "Dare you to tell us the last person you cyber-stalked and why",
  "Post a public instagram story saying \"I'm lonely, ask me questions\" and use the question prompt. At the end of the game, read them all out loud and who it was from. If you don't... You LOSE the entire game, even if you were first.",
  "Text your closest relative something very embarrassing that they wouldn't know about you.",
  "Flirt with everyone in the room using your favorite aspect about them.",
  "Perform \"I'm a little teapot\" with the dance that goes with it.",
  "Put ice in your clothes and leave it until it melts.",
  "Hold water in your mouth and hold it while the group tries to make you laugh. If you don't laugh, you complete this dare.",
  "Draw fake abs on yourself.",
  "Lay on the floor and act like a fish out of water.",
  "Write a breakup message and send it to a random number.",
  "Post a status/story saying \"I Love Playing TriviaDare! #TriviaDare\".",
  "Do your best impression of a popular cartoon character.",
"Speak in an accent of your choice until your next turn.",
"Stand on one foot while touching your nose for 30 seconds.",
"Do 10 jumping jacks right now.",
"Draw a picture with your eyes closed and have others guess what it is.",
"Go to the nearest window and howl like a wolf for 5 seconds.",
"Recite the alphabet backward as quickly as you can.",
"Perform an impression of a famous celebrity for 30 seconds.",
"Try to lick your elbow for 15 seconds.",
"Make up a 30-second commercial for your favorite snack.",
"Do your best robot dance for 20 seconds.",
"Hop on one foot in a circle while patting your head.",
"Speak only in questions until your next turn.",
"Try to balance a spoon on your nose for 20 seconds.",
"Make a paper airplane and throw it across the room.",
"Give your best superhero pose and hold it for 10 seconds.",
"Try to whistle a popular song and have others guess it.",
"Do an impression of someone else in the room.",
"Sing the chorus of a popular song.",
"Act like a monkey for 15 seconds.",
"Make a hat out of available materials and wear it for three rounds.",
"Give everyone a new nickname that they must use for the rest of the game.",
"Speak in slow motion for 30 seconds.",
"Do your best catwalk across the room.",
"Create a secret handshake with the person to your right.",
"Pretend you're underwater for 20 seconds.",
"Try to touch your nose with your tongue while taking a selfie.",
"Do 5 push-ups right now.",
"Make up a short rap about the game you're playing.",
"Pretend to be a news reporter reporting on this game.",
"Make a silly face and hold it until someone laughs.",
"Balance a book on your head and walk across the room.",
"Try to say 'toy boat' five times fast.",
"Do your best impression of a sports announcer.",
"Spin around 10 times and then try to walk in a straight line.",
"Create a new dance move and name it after yourself.",
"Speak without showing your teeth for 30 seconds.",
"Try to stack 5 small objects on top of each other.",
"Do your best impression of a runway model.",
"Say the first 10 digits of pi (3.1415926535).",
"Pretend to be a statue for 30 seconds.",
"Make up a jingle about the person to your left.",
"Do your best animal impression and have others guess what it is.",
"Tell a joke while standing on one foot.",
"Pretend to be a chef cooking a complicated dish.",
"Give a 30-second speech about why pets are better than humans (or vice versa).",
"Do 10 air squats right now.",
"Try to name 15 animals in 30 seconds.",
"Make up a short story that includes the words 'banana,' 'spaceship,' and 'detective.'",
"Do an impression of a famous movie scene.",
"Pretend to be a zombie for 30 seconds.",
"Create a new superhero and demonstrate their special power.",
"Try to do a magic trick with available objects.",
"Speak in rhymes for 30 seconds.",
"Pretend to be on a rollercoaster for 20 seconds.",
"Give a 30-second TED Talk on a random topic chosen by the group.",
"Try to juggle three small objects for 15 seconds.",
"Do your best impression of a TV commercial.",
"Make up a song about your favorite food and sing it.",
"Stand up and do the chicken dance.",
"Try to draw your self-portrait with your non-dominant hand.",
"Pretend to be a tour guide for the room you're in.",
"Do 5 jumping jacks while reciting a nursery rhyme.",
"Create a 30-second workout routine and lead everyone through it.",
"Try to name all 50 states in 60 seconds.",
"Perform a dramatic reading of a text message on your phone.",
"Do your best impression of someone famous opening a speech.",
"Try to balance on one foot with your eyes closed for 15 seconds.",
"Make three animal sounds and have others guess what they are.",
"Create a 30-second commercial for a made-up product.",
"Do your best impression of someone else playing this game.",
"Try to say the months of the year backward in 30 seconds.",
"Pretend to be a musician playing your favorite instrument.",
"Draw something on your face with a washable marker.",
"Act out a scene from your favorite movie without using words.",
"Try to pat your head and rub your stomach while hopping on one foot.",
"Speak in a whisper until your next turn.",
"Make up a new rule for the game that everyone must follow for three rounds.",
"Do an impression of your favorite video game character.",
"Try to wrap a gift with one hand (using available materials).",
"Make a funny face in slow motion.",
"Pretend to be a commentator for an extreme sports event.",
"Try to name 10 countries in 15 seconds.",
"Do a dramatic slow-motion fall.",
"Create a secret signal that you must use every time before speaking for three rounds.",
"Try to say 'she sells seashells by the seashore' three times fast.",
"Pretend to be a spy on a secret mission for 30 seconds.",
"Make up a cheer about the game you're playing.",
"Try to touch your nose with your tongue while standing on one foot.",
"Act out waking up late for an important event.",
"Make up a 30-second story about how the group met in an alternate universe.",
"Try to stack 3 small objects on the back of your hand.",
"Do your best impression of a famous dance move.",
"Speak with an imaginary accent until your next turn.",
"Try to recite the days of the week backwards in 10 seconds.",
"Pretend to be a movie trailer voice guy introducing the group.",
"Make up a short poem using the names of three players.",
"Do your best impression of a weather forecaster.",
"Try to hum a song while keeping a straight face.",
"Pretend to be stuck in an invisible box for 20 seconds.",
"Make up a secret handshake with the person to your left.",
"Try to draw a perfect circle freehand.",
"Act out being on a boat during a storm.",
"Make up a rap about your day so far.",
"Try to do 3 jump-spins in a row.",
"Pretend to be a robot running out of batteries.",
"Make a paper hat and wear it for the rest of the game.",
"Try to speak with your tongue sticking out for 30 seconds.",
"Act out your morning routine in 30 seconds.",
"Make up a song about the room you're in and sing it.",
"Try to say the alphabet with a hiccup sound between each letter.",
"Pretend to be a fashion model showing off your current outfit.",
"Do your best impression of someone opening a surprise gift.",
"Try to name 10 Disney characters in 20 seconds.",
"Act out discovering a treasure chest.",
"Make up a handshake that uses 5 different movements.",
"Try to whistle while smiling as wide as possible.",
"Pretend to be trapped in quicksand for 20 seconds.",
"Make up a 30-second story about your first day as president.",
"Try to make a tower using 5 random objects from the room.",
"Do your best impression of a TV show host.",
"Try to touch your elbows behind your back.",
"Pretend to be conducting an orchestra for 30 seconds.",
"Make up a new word and use it in three different sentences.",
"Try to name 10 fruits in 15 seconds.",
"Act out your favorite sports victory celebration.",
"Make up a short speech accepting an imaginary award.",
"Try to do 5 toe touches while counting backward from 20.",
"Pretend to be a mime for 30 seconds.",
"Make up a jingle for this game.",
"Try to name 7 breakfast foods in 10 seconds.",
"Act out a commercial for your favorite store.",
"Make a mustache with your finger and tell a joke with it.",
"Try to draw a house with your eyes closed.",
"Pretend to be a surfer riding a giant wave.",
"Make up a nickname for everyone in the room.",
"Try to do a moonwalk across the room.",
"Act out taking a selfie in 5 different poses.",
"Make up a 20-second skit about accidentally sending a text to the wrong person.",
"Try to say your full name while holding your nose.",
"Pretend to be a superhero discovering your powers for the first time.",
"Make up a handshake that involves a high-five, fist bump, and spin.",
"Try to do 10 shadow boxing punches in 5 seconds.",
"Act out finding something disgusting in your food.",
"Make up a cheer about someone in the room.",
"Try to recite a nursery rhyme while marching in place.",
"Pretend to be on a horrible first date for 30 seconds.",
"Make a paper airplane and try to hit a target chosen by the group.",
"Try to do your best impression of someone winning a game show.",
"Act out being caught in a rainstorm without an umbrella.",
"Make up a theme song for yourself and sing a few lines.",
"Try to spell your name out loud while hopping on one foot.",
"Pretend to be a chef tasting something incredibly spicy."
]